;***************************************************************
;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
;* Date/Time created: Tue Aug 19 17:11:19 2025                 *
;***************************************************************
	.compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
FP	.set	XAR2

DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Instruments Incorporated")
	.dwattr DW$CU, DW_AT_stmt_list(0x00)
	.dwattr DW$CU, DW_AT_TI_VERSION(0x01)

DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("MoveStop"), DW_AT_symbol_name("_MoveStop")
	.dwattr DW$1, DW_AT_declaration(0x01)
	.dwattr DW$1, DW_AT_external(0x01)
DW$2	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
DW$3	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
DW$4	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
DW$5	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
	.dwendtag DW$1


DW$6	.dwtag  DW_TAG_subprogram, DW_AT_name("initedge"), DW_AT_symbol_name("_initedge")
	.dwattr DW$6, DW_AT_declaration(0x01)
	.dwattr DW$6, DW_AT_external(0x01)

DW$7	.dwtag  DW_TAG_subprogram, DW_AT_name("InitMotor"), DW_AT_symbol_name("_InitMotor")
	.dwattr DW$7, DW_AT_declaration(0x01)
	.dwattr DW$7, DW_AT_external(0x01)
DW$8	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$49)
	.dwendtag DW$7



DW$T$82	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$82, DW_AT_type(*DW$715)

DW$T$83	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$82)
	.dwattr DW$T$83, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$83, DW_AT_byte_size(0x100)
DW$716	.dwtag  DW_TAG_subrange_type
	.dwattr DW$716, DW_AT_upper_bound(0xff)
	.dwendtag DW$T$83


DW$T$84	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$82)
	.dwattr DW$T$84, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$84, DW_AT_byte_size(0x04)
DW$717	.dwtag  DW_TAG_subrange_type
	.dwattr DW$717, DW_AT_upper_bound(0x03)
	.dwendtag DW$T$84

DW$718	.dwtag  DW_TAG_far_type
	.dwattr DW$718, DW_AT_type(*DW$T$19)
DW$T$85	.dwtag  DW_TAG_const_type
	.dwattr DW$T$85, DW_AT_type(*DW$718)

DW$T$86	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$85)
	.dwattr DW$T$86, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$86, DW_AT_byte_size(0x0e)
DW$719	.dwtag  DW_TAG_subrange_type
	.dwattr DW$719, DW_AT_upper_bound(0x0d)
	.dwendtag DW$T$86


DW$T$87	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$85)
	.dwattr DW$T$87, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$87, DW_AT_byte_size(0x04)
DW$720	.dwtag  DW_TAG_subrange_type
	.dwattr DW$720, DW_AT_upper_bound(0x03)
	.dwendtag DW$T$87


DW$T$88	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
	.dwattr DW$T$88, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$88, DW_AT_byte_size(0x04)
DW$721	.dwtag  DW_TAG_subrange_type
	.dwattr DW$721, DW_AT_upper_bound(0x03)
	.dwendtag DW$T$88

DW$T$77	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$11)
	.dwattr DW$T$77, DW_AT_address_class(0x16)
DW$T$92	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$89)
	.dwattr DW$T$92, DW_AT_address_class(0x16)
DW$T$12	.dwtag  DW_TAG_base_type, DW_AT_name("long")
	.dwattr DW$T$12, DW_AT_encoding(DW_ATE_signed)
	.dwattr DW$T$12, DW_AT_byte_size(0x02)
DW$T$23	.dwtag  DW_TAG_typedef, DW_AT_name("_iq17"), DW_AT_type(*DW$T$12)
	.dwattr DW$T$23, DW_AT_language(DW_LANG_C)
DW$T$26	.dwtag  DW_TAG_typedef, DW_AT_name("Uint32"), DW_AT_type(*DW$T$13)
	.dwattr DW$T$26, DW_AT_language(DW_LANG_C)
DW$722	.dwtag  DW_TAG_far_type
	.dwattr DW$722, DW_AT_type(*DW$T$26)
DW$T$99	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$99, DW_AT_type(*DW$722)
DW$T$38	.dwtag  DW_TAG_typedef, DW_AT_name("size_t"), DW_AT_type(*DW$T$13)
	.dwattr DW$T$38, DW_AT_language(DW_LANG_C)
DW$T$16	.dwtag  DW_TAG_base_type, DW_AT_name("float")
	.dwattr DW$T$16, DW_AT_encoding(DW_ATE_float)
	.dwattr DW$T$16, DW_AT_byte_size(0x02)

DW$T$101	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$16)
	.dwattr DW$T$101, DW_AT_language(DW_LANG_C)
DW$723	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
	.dwendtag DW$T$101

DW$T$48	.dwtag  DW_TAG_typedef, DW_AT_name("Motor_Val"), DW_AT_type(*DW$T$47)
	.dwattr DW$T$48, DW_AT_language(DW_LANG_C)
DW$T$49	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$48)
	.dwattr DW$T$49, DW_AT_address_class(0x16)
DW$T$80	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$79)
	.dwattr DW$T$80, DW_AT_address_class(0x16)
DW$724	.dwtag  DW_TAG_far_type
	.dwattr DW$724, DW_AT_type(*DW$T$80)
DW$T$104	.dwtag  DW_TAG_const_type
	.dwattr DW$T$104, DW_AT_type(*DW$724)
DW$725	.dwtag  DW_TAG_far_type
	.dwattr DW$725, DW_AT_type(*DW$T$34)
DW$T$107	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$107, DW_AT_type(*DW$725)

DW$T$110	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$109)
	.dwattr DW$T$110, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$110, DW_AT_byte_size(0x200)
DW$726	.dwtag  DW_TAG_subrange_type
	.dwattr DW$726, DW_AT_upper_bound(0xff)
	.dwendtag DW$T$110

DW$T$111	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$109)
	.dwattr DW$T$111, DW_AT_address_class(0x16)
DW$T$113	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$112)
	.dwattr DW$T$113, DW_AT_address_class(0x16)

DW$T$116	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$115)
	.dwattr DW$T$116, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$116, DW_AT_byte_size(0x200)
DW$727	.dwtag  DW_TAG_subrange_type
	.dwattr DW$727, DW_AT_upper_bound(0xff)
	.dwendtag DW$T$116

DW$T$123	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$122)
	.dwattr DW$T$123, DW_AT_address_class(0x16)
DW$T$125	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$124)
	.dwattr DW$T$125, DW_AT_address_class(0x16)
DW$T$127	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$126)
	.dwattr DW$T$127, DW_AT_address_class(0x16)
DW$T$135	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$134)
	.dwattr DW$T$135, DW_AT_address_class(0x16)
DW$T$145	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$144)
	.dwattr DW$T$145, DW_AT_address_class(0x16)
DW$T$44	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$43)
	.dwattr DW$T$44, DW_AT_address_class(0x16)
DW$728	.dwtag  DW_TAG_far_type
	.dwattr DW$728, DW_AT_type(*DW$T$148)
DW$T$149	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$149, DW_AT_type(*DW$728)
DW$729	.dwtag  DW_TAG_far_type
	.dwattr DW$729, DW_AT_type(*DW$T$151)
DW$T$152	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$152, DW_AT_type(*DW$729)
DW$T$55	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$54)
	.dwattr DW$T$55, DW_AT_address_class(0x16)
DW$730	.dwtag  DW_TAG_far_type
	.dwattr DW$730, DW_AT_type(*DW$T$20)
DW$T$63	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$63, DW_AT_type(*DW$730)
DW$731	.dwtag  DW_TAG_far_type
	.dwattr DW$731, DW_AT_type(*DW$T$10)
DW$T$74	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$74, DW_AT_type(*DW$731)
DW$732	.dwtag  DW_TAG_far_type
	.dwattr DW$732, DW_AT_type(*DW$T$11)
DW$T$89	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$89, DW_AT_type(*DW$732)
DW$T$13	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
	.dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DW$T$13, DW_AT_byte_size(0x02)
DW$733	.dwtag  DW_TAG_far_type
	.dwattr DW$733, DW_AT_type(*DW$T$27)
DW$T$47	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$47, DW_AT_type(*DW$733)
DW$T$79	.dwtag  DW_TAG_typedef, DW_AT_name("Sensor_Val"), DW_AT_type(*DW$T$78)
	.dwattr DW$T$79, DW_AT_language(DW_LANG_C)

DW$T$34	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$34, DW_AT_name("GPIO_DATA_REGS")
	.dwattr DW$T$34, DW_AT_byte_size(0x20)
DW$734	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
	.dwattr DW$734, DW_AT_name("GPADAT"), DW_AT_symbol_name("_GPADAT")
	.dwattr DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$734, DW_AT_accessibility(DW_ACCESS_public)
DW$735	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
	.dwattr DW$735, DW_AT_name("GPASET"), DW_AT_symbol_name("_GPASET")
	.dwattr DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$735, DW_AT_accessibility(DW_ACCESS_public)
DW$736	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
	.dwattr DW$736, DW_AT_name("GPACLEAR"), DW_AT_symbol_name("_GPACLEAR")
	.dwattr DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$736, DW_AT_accessibility(DW_ACCESS_public)
DW$737	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
	.dwattr DW$737, DW_AT_name("GPATOGGLE"), DW_AT_symbol_name("_GPATOGGLE")
	.dwattr DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$737, DW_AT_accessibility(DW_ACCESS_public)
DW$738	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
	.dwattr DW$738, DW_AT_name("GPBDAT"), DW_AT_symbol_name("_GPBDAT")
	.dwattr DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$738, DW_AT_accessibility(DW_ACCESS_public)
DW$739	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
	.dwattr DW$739, DW_AT_name("GPBSET"), DW_AT_symbol_name("_GPBSET")
	.dwattr DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$739, DW_AT_accessibility(DW_ACCESS_public)
DW$740	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
	.dwattr DW$740, DW_AT_name("GPBCLEAR"), DW_AT_symbol_name("_GPBCLEAR")
	.dwattr DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$740, DW_AT_accessibility(DW_ACCESS_public)
DW$741	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
	.dwattr DW$741, DW_AT_name("GPBTOGGLE"), DW_AT_symbol_name("_GPBTOGGLE")
	.dwattr DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$741, DW_AT_accessibility(DW_ACCESS_public)
DW$742	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
	.dwattr DW$742, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
	.dwattr DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$742, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$34

DW$743	.dwtag  DW_TAG_far_type
	.dwattr DW$743, DW_AT_type(*DW$T$35)
DW$T$109	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$109, DW_AT_type(*DW$743)
DW$744	.dwtag  DW_TAG_far_type
	.dwattr DW$744, DW_AT_type(*DW$T$36)
DW$T$112	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$112, DW_AT_type(*DW$744)
DW$745	.dwtag  DW_TAG_far_type
	.dwattr DW$745, DW_AT_type(*DW$T$114)
DW$T$115	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$115, DW_AT_type(*DW$745)
DW$746	.dwtag  DW_TAG_far_type
	.dwattr DW$746, DW_AT_type(*DW$T$37)
DW$T$122	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$122, DW_AT_type(*DW$746)
DW$747	.dwtag  DW_TAG_far_type
	.dwattr DW$747, DW_AT_type(*DW$T$37)
DW$T$124	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$124, DW_AT_type(*DW$747)
DW$748	.dwtag  DW_TAG_far_type
	.dwattr DW$748, DW_AT_type(*DW$T$37)
DW$T$126	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$126, DW_AT_type(*DW$748)
DW$749	.dwtag  DW_TAG_far_type
	.dwattr DW$749, DW_AT_type(*DW$T$37)
DW$T$134	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$134, DW_AT_type(*DW$749)
DW$750	.dwtag  DW_TAG_far_type
	.dwattr DW$750, DW_AT_type(*DW$T$37)
DW$T$144	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$144, DW_AT_type(*DW$750)
DW$T$43	.dwtag  DW_TAG_base_type, DW_AT_name("signed char")
	.dwattr DW$T$43, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr DW$T$43, DW_AT_byte_size(0x01)

DW$T$148	.dwtag  DW_TAG_enumeration_type
	.dwattr DW$T$148, DW_AT_name("EnumTurnState")
	.dwattr DW$T$148, DW_AT_byte_size(0x01)
DW$751	.dwtag  DW_TAG_enumerator, DW_AT_name("STRAIGHT"), DW_AT_const_value(0x00)
DW$752	.dwtag  DW_TAG_enumerator, DW_AT_name("R90"), DW_AT_const_value(0x01)
DW$753	.dwtag  DW_TAG_enumerator, DW_AT_name("BACKTURN"), DW_AT_const_value(0x02)
DW$754	.dwtag  DW_TAG_enumerator, DW_AT_name("L90"), DW_AT_const_value(0x03)
DW$755	.dwtag  DW_TAG_enumerator, DW_AT_name("R180"), DW_AT_const_value(0x04)
DW$756	.dwtag  DW_TAG_enumerator, DW_AT_name("L180"), DW_AT_const_value(0x05)
DW$757	.dwtag  DW_TAG_enumerator, DW_AT_name("R135IN"), DW_AT_const_value(0x06)
DW$758	.dwtag  DW_TAG_enumerator, DW_AT_name("L135IN"), DW_AT_const_value(0x07)
DW$759	.dwtag  DW_TAG_enumerator, DW_AT_name("R45IN"), DW_AT_const_value(0x08)
DW$760	.dwtag  DW_TAG_enumerator, DW_AT_name("L45IN"), DW_AT_const_value(0x09)
DW$761	.dwtag  DW_TAG_enumerator, DW_AT_name("R135OUT"), DW_AT_const_value(0x0a)
DW$762	.dwtag  DW_TAG_enumerator, DW_AT_name("L135OUT"), DW_AT_const_value(0x0b)
DW$763	.dwtag  DW_TAG_enumerator, DW_AT_name("R45OUT"), DW_AT_const_value(0x0c)
DW$764	.dwtag  DW_TAG_enumerator, DW_AT_name("L45OUT"), DW_AT_const_value(0x0d)
DW$765	.dwtag  DW_TAG_enumerator, DW_AT_name("RD90"), DW_AT_const_value(0x0e)
DW$766	.dwtag  DW_TAG_enumerator, DW_AT_name("LD90"), DW_AT_const_value(0x0f)
DW$767	.dwtag  DW_TAG_enumerator, DW_AT_name("RCbr45OUT"), DW_AT_const_value(0x10)
DW$768	.dwtag  DW_TAG_enumerator, DW_AT_name("LCbr45OUT"), DW_AT_const_value(0x11)
DW$769	.dwtag  DW_TAG_enumerator, DW_AT_name("RCbr135OUT"), DW_AT_const_value(0x12)
DW$770	.dwtag  DW_TAG_enumerator, DW_AT_name("LCbr135OUT"), DW_AT_const_value(0x13)
DW$771	.dwtag  DW_TAG_enumerator, DW_AT_name("RDRUN"), DW_AT_const_value(0x14)
DW$772	.dwtag  DW_TAG_enumerator, DW_AT_name("LDRUN"), DW_AT_const_value(0x15)
DW$773	.dwtag  DW_TAG_enumerator, DW_AT_name("NMATCH"), DW_AT_const_value(0x16)
	.dwendtag DW$T$148


DW$T$151	.dwtag  DW_TAG_enumeration_type
	.dwattr DW$T$151, DW_AT_name("EnumMouseHead")
	.dwattr DW$T$151, DW_AT_byte_size(0x01)
DW$774	.dwtag  DW_TAG_enumerator, DW_AT_name("DirectRunState"), DW_AT_const_value(0x00)
DW$775	.dwtag  DW_TAG_enumerator, DW_AT_name("DiagonalRunState"), DW_AT_const_value(0x01)
	.dwendtag DW$T$151


DW$T$33	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
	.dwattr DW$T$33, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$33, DW_AT_byte_size(0x10)
DW$776	.dwtag  DW_TAG_subrange_type
	.dwattr DW$776, DW_AT_upper_bound(0x0f)
	.dwendtag DW$T$33


DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$27, DW_AT_name("Motor_Variable")
	.dwattr DW$T$27, DW_AT_byte_size(0x36)
DW$777	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$777, DW_AT_name("U16Qep_Sample"), DW_AT_symbol_name("_U16Qep_Sample")
	.dwattr DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$777, DW_AT_accessibility(DW_ACCESS_public)
DW$778	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$778, DW_AT_name("U16Tick"), DW_AT_symbol_name("_U16Tick")
	.dwattr DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$778, DW_AT_accessibility(DW_ACCESS_public)
DW$779	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$779, DW_AT_name("dong"), DW_AT_symbol_name("_dong")
	.dwattr DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$779, DW_AT_accessibility(DW_ACCESS_public)
DW$780	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$780, DW_AT_name("i16QepVal"), DW_AT_symbol_name("_i16QepVal")
	.dwattr DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$780, DW_AT_accessibility(DW_ACCESS_public)
DW$781	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$781, DW_AT_name("Stop_Flag"), DW_AT_symbol_name("_Stop_Flag")
	.dwattr DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$781, DW_AT_accessibility(DW_ACCESS_public)
DW$782	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
	.dwattr DW$782, DW_AT_name("Q27Tick_Distance"), DW_AT_symbol_name("_Q27Tick_Distance")
	.dwattr DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$782, DW_AT_accessibility(DW_ACCESS_public)
DW$783	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$783, DW_AT_name("q16pidout"), DW_AT_symbol_name("_q16pidout")
	.dwattr DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$783, DW_AT_accessibility(DW_ACCESS_public)
DW$784	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$784, DW_AT_name("Q17Distace_Sum"), DW_AT_symbol_name("_Q17Distace_Sum")
	.dwattr DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$784, DW_AT_accessibility(DW_ACCESS_public)
DW$785	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$785, DW_AT_name("Q17Kp"), DW_AT_symbol_name("_Q17Kp")
	.dwattr DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$785, DW_AT_accessibility(DW_ACCESS_public)
DW$786	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$786, DW_AT_name("Q17Ki"), DW_AT_symbol_name("_Q17Ki")
	.dwattr DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$786, DW_AT_accessibility(DW_ACCESS_public)
DW$787	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$787, DW_AT_name("Q17Kd"), DW_AT_symbol_name("_Q17Kd")
	.dwattr DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$787, DW_AT_accessibility(DW_ACCESS_public)
DW$788	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$788, DW_AT_name("Q17User_Distacne"), DW_AT_symbol_name("_Q17User_Distacne")
	.dwattr DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$788, DW_AT_accessibility(DW_ACCESS_public)
DW$789	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$789, DW_AT_name("Q17Remaning_Disatance"), DW_AT_symbol_name("_Q17Remaning_Disatance")
	.dwattr DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$789, DW_AT_accessibility(DW_ACCESS_public)
DW$790	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$790, DW_AT_name("Q17Current_Velocity"), DW_AT_symbol_name("_Q17Current_Velocity")
	.dwattr DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$790, DW_AT_accessibility(DW_ACCESS_public)
DW$791	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$791, DW_AT_name("Q17StopDistance"), DW_AT_symbol_name("_Q17StopDistance")
	.dwattr DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$791, DW_AT_accessibility(DW_ACCESS_public)
DW$792	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$792, DW_AT_name("Q17Decel_Velocity"), DW_AT_symbol_name("_Q17Decel_Velocity")
	.dwattr DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr DW$792, DW_AT_accessibility(DW_ACCESS_public)
DW$793	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$793, DW_AT_name("Q17Next_Velocity"), DW_AT_symbol_name("_Q17Next_Velocity")
	.dwattr DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$793, DW_AT_accessibility(DW_ACCESS_public)
DW$794	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$794, DW_AT_name("Q17User_Velocity"), DW_AT_symbol_name("_Q17User_Velocity")
	.dwattr DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr DW$794, DW_AT_accessibility(DW_ACCESS_public)
DW$795	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
	.dwattr DW$795, DW_AT_name("Q17ErrVelocity"), DW_AT_symbol_name("_Q17ErrVelocity")
	.dwattr DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr DW$795, DW_AT_accessibility(DW_ACCESS_public)
DW$796	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$796, DW_AT_name("Q17ErrVelocitySum"), DW_AT_symbol_name("_Q17ErrVelocitySum")
	.dwattr DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr DW$796, DW_AT_accessibility(DW_ACCESS_public)
DW$797	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$797, DW_AT_name("q17proportionalterm"), DW_AT_symbol_name("_q17proportionalterm")
	.dwattr DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr DW$797, DW_AT_accessibility(DW_ACCESS_public)
DW$798	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$798, DW_AT_name("q17derivativeterm"), DW_AT_symbol_name("_q17derivativeterm")
	.dwattr DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr DW$798, DW_AT_accessibility(DW_ACCESS_public)
DW$799	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$799, DW_AT_name("q17integralterm"), DW_AT_symbol_name("_q17integralterm")
	.dwattr DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr DW$799, DW_AT_accessibility(DW_ACCESS_public)
DW$800	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$800, DW_AT_name("q17pidoutterm"), DW_AT_symbol_name("_q17pidoutterm")
	.dwattr DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr DW$800, DW_AT_accessibility(DW_ACCESS_public)
DW$801	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
	.dwattr DW$801, DW_AT_name("q26posadjrate"), DW_AT_symbol_name("_q26posadjrate")
	.dwattr DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr DW$801, DW_AT_accessibility(DW_ACCESS_public)
DW$802	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$802, DW_AT_name("i32Accel"), DW_AT_symbol_name("_i32Accel")
	.dwattr DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr DW$802, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$27

DW$803	.dwtag  DW_TAG_far_type
	.dwattr DW$803, DW_AT_type(*DW$T$28)
DW$T$78	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$78, DW_AT_type(*DW$803)

DW$T$30	.dwtag  DW_TAG_union_type
	.dwattr DW$T$30, DW_AT_name("GPADAT_REG")
	.dwattr DW$T$30, DW_AT_byte_size(0x02)
DW$804	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$804, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$804, DW_AT_accessibility(DW_ACCESS_public)
DW$805	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$805, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$805, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$30


DW$T$32	.dwtag  DW_TAG_union_type
	.dwattr DW$T$32, DW_AT_name("GPBDAT_REG")
	.dwattr DW$T$32, DW_AT_byte_size(0x02)
DW$806	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$806, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$806, DW_AT_accessibility(DW_ACCESS_public)
DW$807	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$807, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$807, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$32


DW$T$35	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$35, DW_AT_name("Path")
	.dwattr DW$T$35, DW_AT_byte_size(0x02)
DW$808	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$808, DW_AT_name("Position"), DW_AT_symbol_name("_Position")
	.dwattr DW$808, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
	.dwattr DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$808, DW_AT_accessibility(DW_ACCESS_public)
DW$809	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$809, DW_AT_name("TurnDir"), DW_AT_symbol_name("_TurnDir")
	.dwattr DW$809, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
	.dwattr DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$809, DW_AT_accessibility(DW_ACCESS_public)
DW$810	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$810, DW_AT_name("MouseDir"), DW_AT_symbol_name("_MouseDir")
	.dwattr DW$810, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
	.dwattr DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$810, DW_AT_accessibility(DW_ACCESS_public)
DW$811	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$811, DW_AT_name("PathCnt"), DW_AT_symbol_name("_PathCnt")
	.dwattr DW$811, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
	.dwattr DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$811, DW_AT_accessibility(DW_ACCESS_public)
DW$812	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$812, DW_AT_name("PathState"), DW_AT_symbol_name("_PathState")
	.dwattr DW$812, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
	.dwattr DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$812, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$35


DW$T$36	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$36, DW_AT_name("bit")
	.dwattr DW$T$36, DW_AT_byte_size(0x02)
DW$813	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$813, DW_AT_name("Weight"), DW_AT_symbol_name("_Weight")
	.dwattr DW$813, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
	.dwattr DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$813, DW_AT_accessibility(DW_ACCESS_public)
DW$814	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$814, DW_AT_name("NowVector"), DW_AT_symbol_name("_NowVector")
	.dwattr DW$814, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
	.dwattr DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$814, DW_AT_accessibility(DW_ACCESS_public)
DW$815	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$815, DW_AT_name("YetVector"), DW_AT_symbol_name("_YetVector")
	.dwattr DW$815, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
	.dwattr DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$815, DW_AT_accessibility(DW_ACCESS_public)
DW$816	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$816, DW_AT_name("BlockCnt"), DW_AT_symbol_name("_BlockCnt")
	.dwattr DW$816, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x06)
	.dwattr DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$816, DW_AT_accessibility(DW_ACCESS_public)
DW$817	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$817, DW_AT_name("BlockState"), DW_AT_symbol_name("_BlockState")
	.dwattr DW$817, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
	.dwattr DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$817, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$36


DW$T$37	.dwtag  DW_TAG_union_type
	.dwattr DW$T$37, DW_AT_byte_size(0x02)
DW$818	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$818, DW_AT_name("ALL_UINT"), DW_AT_symbol_name("_ALL_UINT")
	.dwattr DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$818, DW_AT_accessibility(DW_ACCESS_public)
DW$819	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
	.dwattr DW$819, DW_AT_name("Divide"), DW_AT_symbol_name("_Divide")
	.dwattr DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$819, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$37

DW$T$114	.dwtag  DW_TAG_typedef, DW_AT_name("MapVariable"), DW_AT_type(*DW$T$37)
	.dwattr DW$T$114, DW_AT_language(DW_LANG_C)
DW$T$21	.dwtag  DW_TAG_typedef, DW_AT_name("_iq27"), DW_AT_type(*DW$T$12)
	.dwattr DW$T$21, DW_AT_language(DW_LANG_C)
DW$T$22	.dwtag  DW_TAG_typedef, DW_AT_name("_iq16"), DW_AT_type(*DW$T$12)
	.dwattr DW$T$22, DW_AT_language(DW_LANG_C)

DW$T$24	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$23)
	.dwattr DW$T$24, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$24, DW_AT_byte_size(0x08)
DW$820	.dwtag  DW_TAG_subrange_type
	.dwattr DW$820, DW_AT_upper_bound(0x03)
	.dwendtag DW$T$24

DW$T$25	.dwtag  DW_TAG_typedef, DW_AT_name("_iq26"), DW_AT_type(*DW$T$12)
	.dwattr DW$T$25, DW_AT_language(DW_LANG_C)

DW$T$28	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$28, DW_AT_byte_size(0x1e)
DW$821	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$821, DW_AT_name("Uint16Value"), DW_AT_symbol_name("_Uint16Value")
	.dwattr DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$821, DW_AT_accessibility(DW_ACCESS_public)
DW$822	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$822, DW_AT_name("q17Position"), DW_AT_symbol_name("_q17Position")
	.dwattr DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$822, DW_AT_accessibility(DW_ACCESS_public)
DW$823	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$823, DW_AT_name("q17PositionYet"), DW_AT_symbol_name("_q17PositionYet")
	.dwattr DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$823, DW_AT_accessibility(DW_ACCESS_public)
DW$824	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$824, DW_AT_name("q17PositionDiff"), DW_AT_symbol_name("_q17PositionDiff")
	.dwattr DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$824, DW_AT_accessibility(DW_ACCESS_public)
DW$825	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$825, DW_AT_name("q17HighCoefficient"), DW_AT_symbol_name("_q17HighCoefficient")
	.dwattr DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$825, DW_AT_accessibility(DW_ACCESS_public)
DW$826	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$826, DW_AT_name("q17LowCoefficient"), DW_AT_symbol_name("_q17LowCoefficient")
	.dwattr DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$826, DW_AT_accessibility(DW_ACCESS_public)
DW$827	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$827, DW_AT_name("q17MaxVal"), DW_AT_symbol_name("_q17MaxVal")
	.dwattr DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$827, DW_AT_accessibility(DW_ACCESS_public)
DW$828	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$828, DW_AT_name("q17MinVal"), DW_AT_symbol_name("_q17MinVal")
	.dwattr DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$828, DW_AT_accessibility(DW_ACCESS_public)
DW$829	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$829, DW_AT_name("q17MidVal"), DW_AT_symbol_name("_q17MidVal")
	.dwattr DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$829, DW_AT_accessibility(DW_ACCESS_public)
DW$830	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$830, DW_AT_name("q17LPFOutDataYet"), DW_AT_symbol_name("_q17LPFOutDataYet")
	.dwattr DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$830, DW_AT_accessibility(DW_ACCESS_public)
DW$831	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$831, DW_AT_name("q17LPFOutData"), DW_AT_symbol_name("_q17LPFOutData")
	.dwattr DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$831, DW_AT_accessibility(DW_ACCESS_public)
DW$832	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$832, DW_AT_name("q17LPFInData"), DW_AT_symbol_name("_q17LPFInData")
	.dwattr DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$832, DW_AT_accessibility(DW_ACCESS_public)
DW$833	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$833, DW_AT_name("q17LPFOutDataDiff"), DW_AT_symbol_name("_q17LPFOutDataDiff")
	.dwattr DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$833, DW_AT_accessibility(DW_ACCESS_public)
DW$834	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$834, DW_AT_name("q17LPFInDataDiff"), DW_AT_symbol_name("_q17LPFInDataDiff")
	.dwattr DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr DW$834, DW_AT_accessibility(DW_ACCESS_public)
DW$835	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$835, DW_AT_name("q17LPFInDataDiffYet"), DW_AT_symbol_name("_q17LPFInDataDiffYet")
	.dwattr DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$835, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$28


DW$T$29	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$29, DW_AT_name("GPADAT_BITS")
	.dwattr DW$T$29, DW_AT_byte_size(0x02)
DW$836	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$836, DW_AT_name("GPIO0"), DW_AT_symbol_name("_GPIO0")
	.dwattr DW$836, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$836, DW_AT_accessibility(DW_ACCESS_public)
DW$837	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$837, DW_AT_name("GPIO1"), DW_AT_symbol_name("_GPIO1")
	.dwattr DW$837, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$837, DW_AT_accessibility(DW_ACCESS_public)
DW$838	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$838, DW_AT_name("GPIO2"), DW_AT_symbol_name("_GPIO2")
	.dwattr DW$838, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$838, DW_AT_accessibility(DW_ACCESS_public)
DW$839	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$839, DW_AT_name("GPIO3"), DW_AT_symbol_name("_GPIO3")
	.dwattr DW$839, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$839, DW_AT_accessibility(DW_ACCESS_public)
DW$840	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$840, DW_AT_name("GPIO4"), DW_AT_symbol_name("_GPIO4")
	.dwattr DW$840, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$840, DW_AT_accessibility(DW_ACCESS_public)
DW$841	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$841, DW_AT_name("GPIO5"), DW_AT_symbol_name("_GPIO5")
	.dwattr DW$841, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$841, DW_AT_accessibility(DW_ACCESS_public)
DW$842	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$842, DW_AT_name("GPIO6"), DW_AT_symbol_name("_GPIO6")
	.dwattr DW$842, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$842, DW_AT_accessibility(DW_ACCESS_public)
DW$843	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$843, DW_AT_name("GPIO7"), DW_AT_symbol_name("_GPIO7")
	.dwattr DW$843, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr DW$843, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$843, DW_AT_accessibility(DW_ACCESS_public)
DW$844	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$844, DW_AT_name("GPIO8"), DW_AT_symbol_name("_GPIO8")
	.dwattr DW$844, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr DW$844, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$844, DW_AT_accessibility(DW_ACCESS_public)
DW$845	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$845, DW_AT_name("GPIO9"), DW_AT_symbol_name("_GPIO9")
	.dwattr DW$845, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr DW$845, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$845, DW_AT_accessibility(DW_ACCESS_public)
DW$846	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$846, DW_AT_name("GPIO10"), DW_AT_symbol_name("_GPIO10")
	.dwattr DW$846, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr DW$846, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$846, DW_AT_accessibility(DW_ACCESS_public)
DW$847	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$847, DW_AT_name("GPIO11"), DW_AT_symbol_name("_GPIO11")
	.dwattr DW$847, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr DW$847, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$847, DW_AT_accessibility(DW_ACCESS_public)
DW$848	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$848, DW_AT_name("GPIO12"), DW_AT_symbol_name("_GPIO12")
	.dwattr DW$848, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr DW$848, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$848, DW_AT_accessibility(DW_ACCESS_public)
DW$849	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$849, DW_AT_name("GPIO13"), DW_AT_symbol_name("_GPIO13")
	.dwattr DW$849, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr DW$849, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$849, DW_AT_accessibility(DW_ACCESS_public)
DW$850	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$850, DW_AT_name("GPIO14"), DW_AT_symbol_name("_GPIO14")
	.dwattr DW$850, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr DW$850, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$850, DW_AT_accessibility(DW_ACCESS_public)
DW$851	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$851, DW_AT_name("GPIO15"), DW_AT_symbol_name("_GPIO15")
	.dwattr DW$851, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr DW$851, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$851, DW_AT_accessibility(DW_ACCESS_public)
DW$852	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$852, DW_AT_name("GPIO16"), DW_AT_symbol_name("_GPIO16")
	.dwattr DW$852, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr DW$852, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$852, DW_AT_accessibility(DW_ACCESS_public)
DW$853	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$853, DW_AT_name("GPIO17"), DW_AT_symbol_name("_GPIO17")
	.dwattr DW$853, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr DW$853, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$853, DW_AT_accessibility(DW_ACCESS_public)
DW$854	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$854, DW_AT_name("GPIO18"), DW_AT_symbol_name("_GPIO18")
	.dwattr DW$854, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr DW$854, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$854, DW_AT_accessibility(DW_ACCESS_public)
DW$855	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$855, DW_AT_name("GPIO19"), DW_AT_symbol_name("_GPIO19")
	.dwattr DW$855, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr DW$855, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$855, DW_AT_accessibility(DW_ACCESS_public)
DW$856	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$856, DW_AT_name("GPIO20"), DW_AT_symbol_name("_GPIO20")
	.dwattr DW$856, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr DW$856, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$856, DW_AT_accessibility(DW_ACCESS_public)
DW$857	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$857, DW_AT_name("GPIO21"), DW_AT_symbol_name("_GPIO21")
	.dwattr DW$857, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr DW$857, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$857, DW_AT_accessibility(DW_ACCESS_public)
DW$858	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$858, DW_AT_name("GPIO22"), DW_AT_symbol_name("_GPIO22")
	.dwattr DW$858, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr DW$858, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$858, DW_AT_accessibility(DW_ACCESS_public)
DW$859	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$859, DW_AT_name("GPIO23"), DW_AT_symbol_name("_GPIO23")
	.dwattr DW$859, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr DW$859, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$859, DW_AT_accessibility(DW_ACCESS_public)
DW$860	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$860, DW_AT_name("GPIO24"), DW_AT_symbol_name("_GPIO24")
	.dwattr DW$860, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr DW$860, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$860, DW_AT_accessibility(DW_ACCESS_public)
DW$861	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$861, DW_AT_name("GPIO25"), DW_AT_symbol_name("_GPIO25")
	.dwattr DW$861, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr DW$861, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$861, DW_AT_accessibility(DW_ACCESS_public)
DW$862	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$862, DW_AT_name("GPIO26"), DW_AT_symbol_name("_GPIO26")
	.dwattr DW$862, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr DW$862, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$862, DW_AT_accessibility(DW_ACCESS_public)
DW$863	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$863, DW_AT_name("GPIO27"), DW_AT_symbol_name("_GPIO27")
	.dwattr DW$863, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr DW$863, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$863, DW_AT_accessibility(DW_ACCESS_public)
DW$864	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$864, DW_AT_name("GPIO28"), DW_AT_symbol_name("_GPIO28")
	.dwattr DW$864, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr DW$864, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$864, DW_AT_accessibility(DW_ACCESS_public)
DW$865	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$865, DW_AT_name("GPIO29"), DW_AT_symbol_name("_GPIO29")
	.dwattr DW$865, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr DW$865, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$865, DW_AT_accessibility(DW_ACCESS_public)
DW$866	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$866, DW_AT_name("GPIO30"), DW_AT_symbol_name("_GPIO30")
	.dwattr DW$866, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr DW$866, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$866, DW_AT_accessibility(DW_ACCESS_public)
DW$867	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$867, DW_AT_name("GPIO31"), DW_AT_symbol_name("_GPIO31")
	.dwattr DW$867, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr DW$867, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$867, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$29


DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$31, DW_AT_name("GPBDAT_BITS")
	.dwattr DW$T$31, DW_AT_byte_size(0x02)
DW$868	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$868, DW_AT_name("GPIO32"), DW_AT_symbol_name("_GPIO32")
	.dwattr DW$868, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr DW$868, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$868, DW_AT_accessibility(DW_ACCESS_public)
DW$869	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$869, DW_AT_name("GPIO33"), DW_AT_symbol_name("_GPIO33")
	.dwattr DW$869, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr DW$869, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$869, DW_AT_accessibility(DW_ACCESS_public)
DW$870	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$870, DW_AT_name("GPIO34"), DW_AT_symbol_name("_GPIO34")
	.dwattr DW$870, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr DW$870, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$870, DW_AT_accessibility(DW_ACCESS_public)
DW$871	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$871, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
	.dwattr DW$871, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr DW$871, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$871, DW_AT_accessibility(DW_ACCESS_public)
DW$872	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$872, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
	.dwattr DW$872, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
	.dwattr DW$872, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$872, DW_AT_accessibility(DW_ACCESS_public)
DW$873	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$873, DW_AT_name("rsvd3"), DW_AT_symbol_name("_rsvd3")
	.dwattr DW$873, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
	.dwattr DW$873, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$873, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$31


	.dwattr DW$603, DW_AT_external(0x01)
	.dwattr DW$528, DW_AT_external(0x01)
	.dwattr DW$686, DW_AT_external(0x01)
	.dwattr DW$207, DW_AT_external(0x01)
	.dwattr DW$208, DW_AT_external(0x01)
	.dwattr DW$148, DW_AT_external(0x01)
	.dwattr DW$162, DW_AT_external(0x01)
	.dwattr DW$374, DW_AT_external(0x01)
	.dwattr DW$219, DW_AT_external(0x01)
	.dwattr DW$661, DW_AT_external(0x01)
	.dwattr DW$599, DW_AT_external(0x01)
	.dwattr DW$543, DW_AT_external(0x01)
	.dwattr DW$196, DW_AT_external(0x01)
	.dwattr DW$196, DW_AT_type(*DW$T$19)
	.dwattr DW$168, DW_AT_external(0x01)
	.dwattr DW$120, DW_AT_external(0x01)
	.dwattr DW$92, DW_AT_external(0x01)
	.dwattr DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF CIE ENTRIES                                           *
;***************************************************************

DW$CIE	.dwcie 1, 40
	.dwcfa	0x0c, 20, 0
	.dwcfa	0x07, 0
	.dwcfa	0x07, 1
	.dwcfa	0x07, 2
	.dwcfa	0x07, 3
	.dwcfa	0x07, 4
	.dwcfa	0x07, 5
	.dwcfa	0x08, 6
	.dwcfa	0x08, 7
	.dwcfa	0x08, 8
	.dwcfa	0x08, 9
	.dwcfa	0x08, 10
	.dwcfa	0x08, 11
	.dwcfa	0x07, 12
	.dwcfa	0x07, 13
	.dwcfa	0x07, 14
	.dwcfa	0x07, 15
	.dwcfa	0x07, 16
	.dwcfa	0x07, 17
	.dwcfa	0x07, 18
	.dwcfa	0x07, 19
	.dwcfa	0x07, 20
	.dwcfa	0x07, 21
	.dwcfa	0x07, 22
	.dwcfa	0x07, 23
	.dwcfa	0x07, 24
	.dwcfa	0x07, 25
	.dwcfa	0x07, 26
	.dwcfa	0x08, 27
	.dwcfa	0x07, 28
	.dwcfa	0x07, 29
	.dwcfa	0x07, 30
	.dwcfa	0x07, 31
	.dwcfa	0x07, 32
	.dwcfa	0x07, 33
	.dwcfa	0x07, 34
	.dwcfa	0x07, 35
	.dwcfa	0x07, 36
	.dwcfa	0x07, 37
	.dwcfa	0x07, 38
	.dwcfa	0x07, 39
	.dwcfa	0x07, 40

;***************************************************************
;* DWARF REGISTER MAP                                          *
;***************************************************************

DW$874	.dwtag  DW_TAG_assign_register, DW_AT_name("AL")
	.dwattr DW$874, DW_AT_location[DW_OP_reg0]
DW$875	.dwtag  DW_TAG_assign_register, DW_AT_name("AH")
	.dwattr DW$875, DW_AT_location[DW_OP_reg1]
DW$876	.dwtag  DW_TAG_assign_register, DW_AT_name("PL")
	.dwattr DW$876, DW_AT_location[DW_OP_reg2]
DW$877	.dwtag  DW_TAG_assign_register, DW_AT_name("PH")
	.dwattr DW$877, DW_AT_location[DW_OP_reg3]
DW$878	.dwtag  DW_TAG_assign_register, DW_AT_name("AR0")
	.dwattr DW$878, DW_AT_location[DW_OP_reg4]
DW$879	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR0")
	.dwattr DW$879, DW_AT_location[DW_OP_reg5]
DW$880	.dwtag  DW_TAG_assign_register, DW_AT_name("AR1")
	.dwattr DW$880, DW_AT_location[DW_OP_reg6]
DW$881	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR1")
	.dwattr DW$881, DW_AT_location[DW_OP_reg7]
DW$882	.dwtag  DW_TAG_assign_register, DW_AT_name("AR2")
	.dwattr DW$882, DW_AT_location[DW_OP_reg8]
DW$883	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR2")
	.dwattr DW$883, DW_AT_location[DW_OP_reg9]
DW$884	.dwtag  DW_TAG_assign_register, DW_AT_name("AR3")
	.dwattr DW$884, DW_AT_location[DW_OP_reg10]
DW$885	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR3")
	.dwattr DW$885, DW_AT_location[DW_OP_reg11]
DW$886	.dwtag  DW_TAG_assign_register, DW_AT_name("AR4")
	.dwattr DW$886, DW_AT_location[DW_OP_reg12]
DW$887	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR4")
	.dwattr DW$887, DW_AT_location[DW_OP_reg13]
DW$888	.dwtag  DW_TAG_assign_register, DW_AT_name("AR5")
	.dwattr DW$888, DW_AT_location[DW_OP_reg14]
DW$889	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR5")
	.dwattr DW$889, DW_AT_location[DW_OP_reg15]
DW$890	.dwtag  DW_TAG_assign_register, DW_AT_name("AR6")
	.dwattr DW$890, DW_AT_location[DW_OP_reg16]
DW$891	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR6")
	.dwattr DW$891, DW_AT_location[DW_OP_reg17]
DW$892	.dwtag  DW_TAG_assign_register, DW_AT_name("AR7")
	.dwattr DW$892, DW_AT_location[DW_OP_reg18]
DW$893	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR7")
	.dwattr DW$893, DW_AT_location[DW_OP_reg19]
