;***************************************************************
;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
;* Date/Time created: Tue Aug 19 17:11:18 2025                 *
;***************************************************************
	.compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
FP	.set	XAR2

DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Instruments Incorporated")
	.dwattr DW$CU, DW_AT_stmt_list(0x00)
	.dwattr DW$CU, DW_AT_TI_VERSION(0x01)
;**************************************************************
;* CINIT RECORDS                                              *
;**************************************************************
	.sect	".cinit"
	.align	1
	.field  	-1,16
	.field  	_DiffAdjFOn$1$0+0,32
	.field  	0,16			; _DiffAdjFOn$1$0 @ 0

	.sect	".cinit"
	.align	1
	.field  	-IR_1,16
	.field  	_TurnOutErr+0,32
	.field  	0,32			; _TurnOutErr[0]._T90OutDis @ 0
	.field  	0,32			; _TurnOutErr[0]._T45OutDis @ 32
	.field  	0,32			; _TurnOutErr[0]._T135OutDis @ 64
	.field  	0,32			; _TurnOutErr[0]._T180OutDis @ 96
	.field  	1310720,32			; _TurnOutErr[1]._T90OutDis @ 128
	.field  	9175040,32			; _TurnOutErr[1]._T45OutDis @ 160
	.field  	7208960,32			; _TurnOutErr[1]._T135OutDis @ 192
	.field  	6553600,32			; _TurnOutErr[1]._T180OutDis @ 224
	.field  	2621440,32			; _TurnOutErr[2]._T90OutDis @ 256

	.dwattr DW$T$208, DW_AT_type(*DW$888)

DW$T$209	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$115)
	.dwattr DW$T$209, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$209, DW_AT_byte_size(0xb4)
DW$889	.dwtag  DW_TAG_subrange_type
	.dwattr DW$889, DW_AT_upper_bound(0x05)
	.dwendtag DW$T$209

DW$T$211	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$114)
	.dwattr DW$T$211, DW_AT_address_class(0x16)
DW$890	.dwtag  DW_TAG_far_type
	.dwattr DW$890, DW_AT_type(*DW$T$111)
DW$T$112	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$112, DW_AT_type(*DW$890)
DW$T$113	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$112)
	.dwattr DW$T$113, DW_AT_address_class(0x16)
DW$891	.dwtag  DW_TAG_far_type
	.dwattr DW$891, DW_AT_type(*DW$T$113)
DW$T$214	.dwtag  DW_TAG_const_type
	.dwattr DW$T$214, DW_AT_type(*DW$891)
DW$T$144	.dwtag  DW_TAG_typedef, DW_AT_name("Motor_Val"), DW_AT_type(*DW$T$143)
	.dwattr DW$T$144, DW_AT_language(DW_LANG_C)
DW$T$145	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$144)
	.dwattr DW$T$145, DW_AT_address_class(0x16)
DW$892	.dwtag  DW_TAG_far_type
	.dwattr DW$892, DW_AT_type(*DW$T$145)
DW$T$324	.dwtag  DW_TAG_const_type
	.dwattr DW$T$324, DW_AT_type(*DW$892)
DW$T$325	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$143)
	.dwattr DW$T$325, DW_AT_address_class(0x16)
DW$T$328	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$327)
	.dwattr DW$T$328, DW_AT_address_class(0x16)
DW$893	.dwtag  DW_TAG_far_type
	.dwattr DW$893, DW_AT_type(*DW$T$35)
DW$T$331	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$331, DW_AT_type(*DW$893)
DW$894	.dwtag  DW_TAG_far_type
	.dwattr DW$894, DW_AT_type(*DW$T$46)
DW$T$335	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$335, DW_AT_type(*DW$894)
DW$895	.dwtag  DW_TAG_far_type
	.dwattr DW$895, DW_AT_type(*DW$T$91)
DW$T$345	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$345, DW_AT_type(*DW$895)
DW$896	.dwtag  DW_TAG_far_type
	.dwattr DW$896, DW_AT_type(*DW$T$109)
DW$T$348	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$348, DW_AT_type(*DW$896)

DW$T$351	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$350)
	.dwattr DW$T$351, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$351, DW_AT_byte_size(0x200)
DW$897	.dwtag  DW_TAG_subrange_type
	.dwattr DW$897, DW_AT_upper_bound(0xff)
	.dwendtag DW$T$351

DW$T$352	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$350)
	.dwattr DW$T$352, DW_AT_address_class(0x16)
DW$T$355	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$354)
	.dwattr DW$T$355, DW_AT_address_class(0x16)

DW$T$358	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$356)
	.dwattr DW$T$358, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$358, DW_AT_byte_size(0xbb8)
DW$898	.dwtag  DW_TAG_subrange_type
	.dwattr DW$898, DW_AT_upper_bound(0x04)
DW$899	.dwtag  DW_TAG_subrange_type
	.dwattr DW$899, DW_AT_upper_bound(0x13)
	.dwendtag DW$T$358

DW$T$360	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$359)
	.dwattr DW$T$360, DW_AT_address_class(0x16)

DW$T$421	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$420)
	.dwattr DW$T$421, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$421, DW_AT_byte_size(0x28)
DW$900	.dwtag  DW_TAG_subrange_type
	.dwattr DW$900, DW_AT_upper_bound(0x04)
	.dwendtag DW$T$421

DW$T$423	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$419)
	.dwattr DW$T$423, DW_AT_address_class(0x16)

DW$T$426	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$425)
	.dwattr DW$T$426, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$426, DW_AT_byte_size(0x28)
DW$901	.dwtag  DW_TAG_subrange_type
	.dwattr DW$901, DW_AT_upper_bound(0x04)
	.dwendtag DW$T$426

DW$T$131	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$130)
	.dwattr DW$T$131, DW_AT_address_class(0x16)
DW$902	.dwtag  DW_TAG_far_type
DW$T$121	.dwtag  DW_TAG_const_type
	.dwattr DW$T$121, DW_AT_type(*DW$902)
DW$903	.dwtag  DW_TAG_far_type
	.dwattr DW$903, DW_AT_type(*DW$T$19)
DW$T$163	.dwtag  DW_TAG_const_type
	.dwattr DW$T$163, DW_AT_type(*DW$903)
DW$904	.dwtag  DW_TAG_far_type
	.dwattr DW$904, DW_AT_type(*DW$T$11)
DW$T$166	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$166, DW_AT_type(*DW$904)
DW$905	.dwtag  DW_TAG_far_type
	.dwattr DW$905, DW_AT_type(*DW$T$11)
DW$T$172	.dwtag  DW_TAG_const_type
	.dwattr DW$T$172, DW_AT_type(*DW$905)

DW$T$173	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$172)
	.dwattr DW$T$173, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$173, DW_AT_byte_size(0x03)
DW$906	.dwtag  DW_TAG_subrange_type
	.dwattr DW$906, DW_AT_upper_bound(0x02)
	.dwendtag DW$T$173

DW$907	.dwtag  DW_TAG_far_type
	.dwattr DW$907, DW_AT_type(*DW$T$117)
DW$908	.dwtag  DW_TAG_const_type
	.dwattr DW$908, DW_AT_type(*DW$907)
DW$T$183	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$183, DW_AT_type(*DW$908)
DW$909	.dwtag  DW_TAG_far_type
	.dwattr DW$909, DW_AT_type(*DW$T$192)
DW$T$193	.dwtag  DW_TAG_const_type
	.dwattr DW$T$193, DW_AT_type(*DW$909)
DW$910	.dwtag  DW_TAG_far_type
	.dwattr DW$910, DW_AT_type(*DW$T$12)
DW$T$195	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$195, DW_AT_type(*DW$910)

DW$T$196	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$195)
	.dwattr DW$T$196, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$196, DW_AT_byte_size(0x08)
DW$911	.dwtag  DW_TAG_subrange_type
	.dwattr DW$911, DW_AT_upper_bound(0x03)
	.dwendtag DW$T$196

DW$912	.dwtag  DW_TAG_far_type
	.dwattr DW$912, DW_AT_type(*DW$T$21)
DW$T$114	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$114, DW_AT_type(*DW$912)
DW$T$115	.dwtag  DW_TAG_typedef, DW_AT_name("Sensor_Val"), DW_AT_type(*DW$T$114)
	.dwattr DW$T$115, DW_AT_language(DW_LANG_C)
DW$T$111	.dwtag  DW_TAG_typedef, DW_AT_name("EdgeVariable"), DW_AT_type(*DW$T$23)
	.dwattr DW$T$111, DW_AT_language(DW_LANG_C)
DW$913	.dwtag  DW_TAG_far_type
	.dwattr DW$913, DW_AT_type(*DW$T$29)
DW$T$143	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$143, DW_AT_type(*DW$913)
DW$914	.dwtag  DW_TAG_far_type
	.dwattr DW$914, DW_AT_type(*DW$T$30)
DW$T$327	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$327, DW_AT_type(*DW$914)

DW$T$35	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$35, DW_AT_name("GPIO_DATA_REGS")
	.dwattr DW$T$35, DW_AT_byte_size(0x20)
DW$915	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$915, DW_AT_name("GPADAT"), DW_AT_symbol_name("_GPADAT")
	.dwattr DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$915, DW_AT_accessibility(DW_ACCESS_public)
DW$916	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$916, DW_AT_name("GPASET"), DW_AT_symbol_name("_GPASET")
	.dwattr DW$916, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$916, DW_AT_accessibility(DW_ACCESS_public)
DW$917	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$917, DW_AT_name("GPACLEAR"), DW_AT_symbol_name("_GPACLEAR")
	.dwattr DW$917, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$917, DW_AT_accessibility(DW_ACCESS_public)
DW$918	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$918, DW_AT_name("GPATOGGLE"), DW_AT_symbol_name("_GPATOGGLE")
	.dwattr DW$918, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$918, DW_AT_accessibility(DW_ACCESS_public)
DW$919	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
	.dwattr DW$919, DW_AT_name("GPBDAT"), DW_AT_symbol_name("_GPBDAT")
	.dwattr DW$919, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$919, DW_AT_accessibility(DW_ACCESS_public)
DW$920	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
	.dwattr DW$920, DW_AT_name("GPBSET"), DW_AT_symbol_name("_GPBSET")
	.dwattr DW$920, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$920, DW_AT_accessibility(DW_ACCESS_public)
DW$921	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
	.dwattr DW$921, DW_AT_name("GPBCLEAR"), DW_AT_symbol_name("_GPBCLEAR")
	.dwattr DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$921, DW_AT_accessibility(DW_ACCESS_public)
DW$922	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
	.dwattr DW$922, DW_AT_name("GPBTOGGLE"), DW_AT_symbol_name("_GPBTOGGLE")
	.dwattr DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$922, DW_AT_accessibility(DW_ACCESS_public)
DW$923	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
	.dwattr DW$923, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
	.dwattr DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$923, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$35


DW$T$46	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$46, DW_AT_name("CPUTIMER_REGS")
	.dwattr DW$T$46, DW_AT_byte_size(0x08)
DW$924	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
	.dwattr DW$924, DW_AT_name("TIM"), DW_AT_symbol_name("_TIM")
	.dwattr DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$924, DW_AT_accessibility(DW_ACCESS_public)
DW$925	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$925, DW_AT_name("PRD"), DW_AT_symbol_name("_PRD")
	.dwattr DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$925, DW_AT_accessibility(DW_ACCESS_public)
DW$926	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
	.dwattr DW$926, DW_AT_name("TCR"), DW_AT_symbol_name("_TCR")
	.dwattr DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$926, DW_AT_accessibility(DW_ACCESS_public)
DW$927	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$927, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
	.dwattr DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$927, DW_AT_accessibility(DW_ACCESS_public)
DW$928	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
	.dwattr DW$928, DW_AT_name("TPR"), DW_AT_symbol_name("_TPR")
	.dwattr DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$928, DW_AT_accessibility(DW_ACCESS_public)
DW$929	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
	.dwattr DW$929, DW_AT_name("TPRH"), DW_AT_symbol_name("_TPRH")
	.dwattr DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$929, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$46


DW$T$91	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$91, DW_AT_name("EPWM_REGS")
	.dwattr DW$T$91, DW_AT_byte_size(0x22)
DW$930	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$930, DW_AT_name("TBCTL"), DW_AT_symbol_name("_TBCTL")
	.dwattr DW$930, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$930, DW_AT_accessibility(DW_ACCESS_public)
DW$931	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
	.dwattr DW$931, DW_AT_name("TBSTS"), DW_AT_symbol_name("_TBSTS")
	.dwattr DW$931, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$931, DW_AT_accessibility(DW_ACCESS_public)
DW$932	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
	.dwattr DW$932, DW_AT_name("TBPHS"), DW_AT_symbol_name("_TBPHS")
	.dwattr DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$932, DW_AT_accessibility(DW_ACCESS_public)
DW$933	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$933, DW_AT_name("TBCTR"), DW_AT_symbol_name("_TBCTR")
	.dwattr DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$933, DW_AT_accessibility(DW_ACCESS_public)
DW$934	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$934, DW_AT_name("TBPRD"), DW_AT_symbol_name("_TBPRD")
	.dwattr DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$934, DW_AT_accessibility(DW_ACCESS_public)
DW$935	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$935, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
	.dwattr DW$935, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$935, DW_AT_accessibility(DW_ACCESS_public)
DW$936	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$54)
	.dwattr DW$936, DW_AT_name("CMPCTL"), DW_AT_symbol_name("_CMPCTL")
	.dwattr DW$936, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$936, DW_AT_accessibility(DW_ACCESS_public)
DW$937	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
	.dwattr DW$937, DW_AT_name("CMPA"), DW_AT_symbol_name("_CMPA")
	.dwattr DW$937, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$937, DW_AT_accessibility(DW_ACCESS_public)
DW$938	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$938, DW_AT_name("CMPB"), DW_AT_symbol_name("_CMPB")
	.dwattr DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$938, DW_AT_accessibility(DW_ACCESS_public)
DW$939	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
	.dwattr DW$939, DW_AT_name("AQCTLA"), DW_AT_symbol_name("_AQCTLA")
	.dwattr DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$939, DW_AT_accessibility(DW_ACCESS_public)
DW$940	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
	.dwattr DW$940, DW_AT_name("AQCTLB"), DW_AT_symbol_name("_AQCTLB")
	.dwattr DW$940, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$940, DW_AT_accessibility(DW_ACCESS_public)
DW$941	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$60)
	.dwattr DW$941, DW_AT_name("AQSFRC"), DW_AT_symbol_name("_AQSFRC")
	.dwattr DW$941, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr DW$941, DW_AT_accessibility(DW_ACCESS_public)
DW$942	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$62)
	.dwattr DW$942, DW_AT_name("AQCSFRC"), DW_AT_symbol_name("_AQCSFRC")
	.dwattr DW$942, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$942, DW_AT_accessibility(DW_ACCESS_public)
DW$943	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
	.dwattr DW$943, DW_AT_name("DBCTL"), DW_AT_symbol_name("_DBCTL")
	.dwattr DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr DW$943, DW_AT_accessibility(DW_ACCESS_public)
DW$944	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$944, DW_AT_name("DBRED"), DW_AT_symbol_name("_DBRED")
	.dwattr DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$944, DW_AT_accessibility(DW_ACCESS_public)
DW$945	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$945, DW_AT_name("DBFED"), DW_AT_symbol_name("_DBFED")
	.dwattr DW$945, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr DW$945, DW_AT_accessibility(DW_ACCESS_public)
DW$946	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
	.dwattr DW$946, DW_AT_name("TZSEL"), DW_AT_symbol_name("_TZSEL")
	.dwattr DW$946, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$946, DW_AT_accessibility(DW_ACCESS_public)
DW$947	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$947, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
	.dwattr DW$947, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr DW$947, DW_AT_accessibility(DW_ACCESS_public)
DW$948	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
	.dwattr DW$948, DW_AT_name("TZCTL"), DW_AT_symbol_name("_TZCTL")
	.dwattr DW$948, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$948, DW_AT_accessibility(DW_ACCESS_public)
DW$949	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
	.dwattr DW$949, DW_AT_name("TZEINT"), DW_AT_symbol_name("_TZEINT")
	.dwattr DW$949, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr DW$949, DW_AT_accessibility(DW_ACCESS_public)
DW$950	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$72)
	.dwattr DW$950, DW_AT_name("TZFLG"), DW_AT_symbol_name("_TZFLG")
	.dwattr DW$950, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$950, DW_AT_accessibility(DW_ACCESS_public)
DW$951	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$74)
	.dwattr DW$951, DW_AT_name("TZCLR"), DW_AT_symbol_name("_TZCLR")
	.dwattr DW$951, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr DW$951, DW_AT_accessibility(DW_ACCESS_public)
DW$952	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$76)
	.dwattr DW$952, DW_AT_name("TZFRC"), DW_AT_symbol_name("_TZFRC")
	.dwattr DW$952, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$952, DW_AT_accessibility(DW_ACCESS_public)
DW$953	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$78)
	.dwattr DW$953, DW_AT_name("ETSEL"), DW_AT_symbol_name("_ETSEL")
	.dwattr DW$953, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr DW$953, DW_AT_accessibility(DW_ACCESS_public)
DW$954	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
	.dwattr DW$954, DW_AT_name("ETPS"), DW_AT_symbol_name("_ETPS")
	.dwattr DW$954, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr DW$954, DW_AT_accessibility(DW_ACCESS_public)
DW$955	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$82)
	.dwattr DW$955, DW_AT_name("ETFLG"), DW_AT_symbol_name("_ETFLG")
	.dwattr DW$955, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr DW$955, DW_AT_accessibility(DW_ACCESS_public)
DW$956	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$84)
	.dwattr DW$956, DW_AT_name("ETCLR"), DW_AT_symbol_name("_ETCLR")
	.dwattr DW$956, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$956, DW_AT_accessibility(DW_ACCESS_public)
DW$957	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$86)
	.dwattr DW$957, DW_AT_name("ETFRC"), DW_AT_symbol_name("_ETFRC")
	.dwattr DW$957, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr DW$957, DW_AT_accessibility(DW_ACCESS_public)
DW$958	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$88)
	.dwattr DW$958, DW_AT_name("PCCTL"), DW_AT_symbol_name("_PCCTL")
	.dwattr DW$958, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr DW$958, DW_AT_accessibility(DW_ACCESS_public)
DW$959	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$959, DW_AT_name("rsvd3"), DW_AT_symbol_name("_rsvd3")
	.dwattr DW$959, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
	.dwattr DW$959, DW_AT_accessibility(DW_ACCESS_public)
DW$960	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$90)
	.dwattr DW$960, DW_AT_name("HRCNFG"), DW_AT_symbol_name("_HRCNFG")
	.dwattr DW$960, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr DW$960, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$91


DW$T$109	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$109, DW_AT_name("EQEP_REGS")
	.dwattr DW$T$109, DW_AT_byte_size(0x40)
DW$961	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$961, DW_AT_name("QPOSCNT"), DW_AT_symbol_name("_QPOSCNT")
	.dwattr DW$961, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$961, DW_AT_accessibility(DW_ACCESS_public)
DW$962	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$962, DW_AT_name("QPOSINIT"), DW_AT_symbol_name("_QPOSINIT")
	.dwattr DW$962, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$962, DW_AT_accessibility(DW_ACCESS_public)
DW$963	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$963, DW_AT_name("QPOSMAX"), DW_AT_symbol_name("_QPOSMAX")
	.dwattr DW$963, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$963, DW_AT_accessibility(DW_ACCESS_public)
DW$964	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$964, DW_AT_name("QPOSCMP"), DW_AT_symbol_name("_QPOSCMP")
	.dwattr DW$964, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$964, DW_AT_accessibility(DW_ACCESS_public)
DW$965	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$965, DW_AT_name("QPOSILAT"), DW_AT_symbol_name("_QPOSILAT")
	.dwattr DW$965, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$965, DW_AT_accessibility(DW_ACCESS_public)
DW$966	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$966, DW_AT_name("QPOSSLAT"), DW_AT_symbol_name("_QPOSSLAT")
	.dwattr DW$966, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$966, DW_AT_accessibility(DW_ACCESS_public)
DW$967	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$967, DW_AT_name("QPOSLAT"), DW_AT_symbol_name("_QPOSLAT")
	.dwattr DW$967, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$967, DW_AT_accessibility(DW_ACCESS_public)
DW$968	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$968, DW_AT_name("QUTMR"), DW_AT_symbol_name("_QUTMR")
	.dwattr DW$968, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$968, DW_AT_accessibility(DW_ACCESS_public)
DW$969	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$969, DW_AT_name("QUPRD"), DW_AT_symbol_name("_QUPRD")
	.dwattr DW$969, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$969, DW_AT_accessibility(DW_ACCESS_public)
DW$970	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$970, DW_AT_name("QWDTMR"), DW_AT_symbol_name("_QWDTMR")
	.dwattr DW$970, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$970, DW_AT_accessibility(DW_ACCESS_public)
DW$971	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$971, DW_AT_name("QWDPRD"), DW_AT_symbol_name("_QWDPRD")
	.dwattr DW$971, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr DW$971, DW_AT_accessibility(DW_ACCESS_public)
DW$972	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$93)
	.dwattr DW$972, DW_AT_name("QDECCTL"), DW_AT_symbol_name("_QDECCTL")
	.dwattr DW$972, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$972, DW_AT_accessibility(DW_ACCESS_public)
DW$973	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$95)
	.dwattr DW$973, DW_AT_name("QEPCTL"), DW_AT_symbol_name("_QEPCTL")
	.dwattr DW$973, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr DW$973, DW_AT_accessibility(DW_ACCESS_public)
DW$974	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$97)
	.dwattr DW$974, DW_AT_name("QCAPCTL"), DW_AT_symbol_name("_QCAPCTL")
	.dwattr DW$974, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$974, DW_AT_accessibility(DW_ACCESS_public)
DW$975	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
	.dwattr DW$975, DW_AT_name("QPOSCTL"), DW_AT_symbol_name("_QPOSCTL")
	.dwattr DW$975, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr DW$975, DW_AT_accessibility(DW_ACCESS_public)
DW$976	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$101)
	.dwattr DW$976, DW_AT_name("QEINT"), DW_AT_symbol_name("_QEINT")
	.dwattr DW$976, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$976, DW_AT_accessibility(DW_ACCESS_public)
DW$977	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$103)
	.dwattr DW$977, DW_AT_name("QFLG"), DW_AT_symbol_name("_QFLG")
	.dwattr DW$977, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr DW$977, DW_AT_accessibility(DW_ACCESS_public)
DW$978	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$103)
	.dwattr DW$978, DW_AT_name("QCLR"), DW_AT_symbol_name("_QCLR")
	.dwattr DW$978, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr DW$978, DW_AT_accessibility(DW_ACCESS_public)
DW$979	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$105)
	.dwattr DW$979, DW_AT_name("QFRC"), DW_AT_symbol_name("_QFRC")
	.dwattr DW$979, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr DW$979, DW_AT_accessibility(DW_ACCESS_public)
DW$980	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
	.dwattr DW$980, DW_AT_name("QEPSTS"), DW_AT_symbol_name("_QEPSTS")
	.dwattr DW$980, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$980, DW_AT_accessibility(DW_ACCESS_public)
DW$981	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$981, DW_AT_name("QCTMR"), DW_AT_symbol_name("_QCTMR")
	.dwattr DW$981, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr DW$981, DW_AT_accessibility(DW_ACCESS_public)
DW$982	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$982, DW_AT_name("QCPRD"), DW_AT_symbol_name("_QCPRD")
	.dwattr DW$982, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr DW$982, DW_AT_accessibility(DW_ACCESS_public)
DW$983	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$983, DW_AT_name("QCTMRLAT"), DW_AT_symbol_name("_QCTMRLAT")
	.dwattr DW$983, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
	.dwattr DW$983, DW_AT_accessibility(DW_ACCESS_public)
DW$984	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$984, DW_AT_name("QCPRDLAT"), DW_AT_symbol_name("_QCPRDLAT")
	.dwattr DW$984, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr DW$984, DW_AT_accessibility(DW_ACCESS_public)
DW$985	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$108)
	.dwattr DW$985, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
	.dwattr DW$985, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr DW$985, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$109

DW$986	.dwtag  DW_TAG_far_type
	.dwattr DW$986, DW_AT_type(*DW$T$110)
DW$T$350	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$350, DW_AT_type(*DW$986)
DW$987	.dwtag  DW_TAG_far_type
	.dwattr DW$987, DW_AT_type(*DW$T$353)
DW$T$354	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$354, DW_AT_type(*DW$987)
DW$988	.dwtag  DW_TAG_far_type
	.dwattr DW$988, DW_AT_type(*DW$T$353)
DW$989	.dwtag  DW_TAG_const_type
	.dwattr DW$989, DW_AT_type(*DW$988)
DW$T$356	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$356, DW_AT_type(*DW$989)
DW$990	.dwtag  DW_TAG_far_type
	.dwattr DW$990, DW_AT_type(*DW$T$118)
DW$T$359	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$359, DW_AT_type(*DW$990)
DW$991	.dwtag  DW_TAG_far_type
	.dwattr DW$991, DW_AT_type(*DW$T$119)
DW$T$419	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$419, DW_AT_type(*DW$991)
DW$T$420	.dwtag  DW_TAG_typedef, DW_AT_name("TurnOutDis"), DW_AT_type(*DW$T$419)
	.dwattr DW$T$420, DW_AT_language(DW_LANG_C)
DW$T$425	.dwtag  DW_TAG_typedef, DW_AT_name("TurnInDis"), DW_AT_type(*DW$T$424)
	.dwattr DW$T$425, DW_AT_language(DW_LANG_C)
DW$T$130	.dwtag  DW_TAG_base_type, DW_AT_name("signed char")
	.dwattr DW$T$130, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr DW$T$130, DW_AT_byte_size(0x01)

DW$T$34	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
	.dwattr DW$T$34, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$34, DW_AT_byte_size(0x10)
DW$992	.dwtag  DW_TAG_subrange_type
	.dwattr DW$992, DW_AT_upper_bound(0x0f)
	.dwendtag DW$T$34


DW$T$108	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
	.dwattr DW$T$108, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$108, DW_AT_byte_size(0x1e)
DW$993	.dwtag  DW_TAG_subrange_type
	.dwattr DW$993, DW_AT_upper_bound(0x1d)
	.dwendtag DW$T$108

DW$T$192	.dwtag  DW_TAG_typedef, DW_AT_name("_iq6"), DW_AT_type(*DW$T$12)
	.dwattr DW$T$192, DW_AT_language(DW_LANG_C)

DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$21, DW_AT_byte_size(0x1e)
DW$994	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$994, DW_AT_name("Uint16Value"), DW_AT_symbol_name("_Uint16Value")
	.dwattr DW$994, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$994, DW_AT_accessibility(DW_ACCESS_public)
DW$995	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$995, DW_AT_name("q17Position"), DW_AT_symbol_name("_q17Position")
	.dwattr DW$995, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$995, DW_AT_accessibility(DW_ACCESS_public)
DW$996	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$996, DW_AT_name("q17PositionYet"), DW_AT_symbol_name("_q17PositionYet")
	.dwattr DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$996, DW_AT_accessibility(DW_ACCESS_public)
DW$997	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$997, DW_AT_name("q17PositionDiff"), DW_AT_symbol_name("_q17PositionDiff")
	.dwattr DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$997, DW_AT_accessibility(DW_ACCESS_public)
DW$998	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$998, DW_AT_name("q17HighCoefficient"), DW_AT_symbol_name("_q17HighCoefficient")
	.dwattr DW$998, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$998, DW_AT_accessibility(DW_ACCESS_public)
DW$999	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$999, DW_AT_name("q17LowCoefficient"), DW_AT_symbol_name("_q17LowCoefficient")
	.dwattr DW$999, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$999, DW_AT_accessibility(DW_ACCESS_public)
DW$1000	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$1000, DW_AT_name("q17MaxVal"), DW_AT_symbol_name("_q17MaxVal")
	.dwattr DW$1000, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$1000, DW_AT_accessibility(DW_ACCESS_public)
DW$1001	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$1001, DW_AT_name("q17MinVal"), DW_AT_symbol_name("_q17MinVal")
	.dwattr DW$1001, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$1001, DW_AT_accessibility(DW_ACCESS_public)
DW$1002	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$1002, DW_AT_name("q17MidVal"), DW_AT_symbol_name("_q17MidVal")
	.dwattr DW$1002, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$1002, DW_AT_accessibility(DW_ACCESS_public)
DW$1003	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$1003, DW_AT_name("q17LPFOutDataYet"), DW_AT_symbol_name("_q17LPFOutDataYet")
	.dwattr DW$1003, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$1003, DW_AT_accessibility(DW_ACCESS_public)
DW$1004	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$1004, DW_AT_name("q17LPFOutData"), DW_AT_symbol_name("_q17LPFOutData")
	.dwattr DW$1004, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$1004, DW_AT_accessibility(DW_ACCESS_public)
DW$1005	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$1005, DW_AT_name("q17LPFInData"), DW_AT_symbol_name("_q17LPFInData")
	.dwattr DW$1005, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$1005, DW_AT_accessibility(DW_ACCESS_public)
DW$1006	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$1006, DW_AT_name("q17LPFOutDataDiff"), DW_AT_symbol_name("_q17LPFOutDataDiff")
	.dwattr DW$1006, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$1006, DW_AT_accessibility(DW_ACCESS_public)
DW$1007	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$1007, DW_AT_name("q17LPFInDataDiff"), DW_AT_symbol_name("_q17LPFInDataDiff")
	.dwattr DW$1007, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr DW$1007, DW_AT_accessibility(DW_ACCESS_public)
DW$1008	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$1008, DW_AT_name("q17LPFInDataDiffYet"), DW_AT_symbol_name("_q17LPFInDataDiffYet")
	.dwattr DW$1008, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$1008, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$21


DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$23, DW_AT_byte_size(0x0a)
DW$1009	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$1009, DW_AT_name("u32EdgeCheckTick"), DW_AT_symbol_name("_u32EdgeCheckTick")
	.dwattr DW$1009, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1009, DW_AT_accessibility(DW_ACCESS_public)
DW$1010	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1010, DW_AT_name("u16EdgeState"), DW_AT_symbol_name("_u16EdgeState")
	.dwattr DW$1010, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$1010, DW_AT_accessibility(DW_ACCESS_public)
DW$1011	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1011, DW_AT_name("u16LimitCnt"), DW_AT_symbol_name("_u16LimitCnt")
	.dwattr DW$1011, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$1011, DW_AT_accessibility(DW_ACCESS_public)
DW$1012	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1012, DW_AT_name("u16DelCnt"), DW_AT_symbol_name("_u16DelCnt")
	.dwattr DW$1012, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$1012, DW_AT_accessibility(DW_ACCESS_public)
DW$1013	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1013, DW_AT_name("u16WallCheckTick"), DW_AT_symbol_name("_u16WallCheckTick")
	.dwattr DW$1013, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$1013, DW_AT_accessibility(DW_ACCESS_public)
DW$1014	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1014, DW_AT_name("u16WallState"), DW_AT_symbol_name("_u16WallState")
	.dwattr DW$1014, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$1014, DW_AT_accessibility(DW_ACCESS_public)
DW$1015	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1015, DW_AT_name("u16EdgeOn"), DW_AT_symbol_name("_u16EdgeOn")
	.dwattr DW$1015, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$1015, DW_AT_accessibility(DW_ACCESS_public)
DW$1016	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1016, DW_AT_name("u16EdgeOnTick"), DW_AT_symbol_name("_u16EdgeOnTick")
	.dwattr DW$1016, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$1016, DW_AT_accessibility(DW_ACCESS_public)
DW$1017	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1017, DW_AT_name("u16WallFallTick"), DW_AT_symbol_name("_u16WallFallTick")
	.dwattr DW$1017, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$1017, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$23


DW$T$29	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$29, DW_AT_name("Motor_Variable")
	.dwattr DW$T$29, DW_AT_byte_size(0x36)
DW$1018	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1018, DW_AT_name("U16Qep_Sample"), DW_AT_symbol_name("_U16Qep_Sample")
	.dwattr DW$1018, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1018, DW_AT_accessibility(DW_ACCESS_public)
DW$1019	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1019, DW_AT_name("U16Tick"), DW_AT_symbol_name("_U16Tick")
	.dwattr DW$1019, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1019, DW_AT_accessibility(DW_ACCESS_public)
DW$1020	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1020, DW_AT_name("dong"), DW_AT_symbol_name("_dong")
	.dwattr DW$1020, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$1020, DW_AT_accessibility(DW_ACCESS_public)
DW$1021	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
	.dwattr DW$1021, DW_AT_name("i16QepVal"), DW_AT_symbol_name("_i16QepVal")
	.dwattr DW$1021, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$1021, DW_AT_accessibility(DW_ACCESS_public)
DW$1022	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
	.dwattr DW$1022, DW_AT_name("Stop_Flag"), DW_AT_symbol_name("_Stop_Flag")
	.dwattr DW$1022, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$1022, DW_AT_accessibility(DW_ACCESS_public)
DW$1023	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
	.dwattr DW$1023, DW_AT_name("Q27Tick_Distance"), DW_AT_symbol_name("_Q27Tick_Distance")
	.dwattr DW$1023, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$1023, DW_AT_accessibility(DW_ACCESS_public)
DW$1024	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$1024, DW_AT_name("q16pidout"), DW_AT_symbol_name("_q16pidout")
	.dwattr DW$1024, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$1024, DW_AT_accessibility(DW_ACCESS_public)
DW$1025	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$1025, DW_AT_name("Q17Distace_Sum"), DW_AT_symbol_name("_Q17Distace_Sum")
	.dwattr DW$1025, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$1025, DW_AT_accessibility(DW_ACCESS_public)
DW$1026	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$1026, DW_AT_name("Q17Kp"), DW_AT_symbol_name("_Q17Kp")
	.dwattr DW$1026, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$1026, DW_AT_accessibility(DW_ACCESS_public)
DW$1027	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$1027, DW_AT_name("Q17Ki"), DW_AT_symbol_name("_Q17Ki")
	.dwattr DW$1027, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$1027, DW_AT_accessibility(DW_ACCESS_public)
DW$1028	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$1028, DW_AT_name("Q17Kd"), DW_AT_symbol_name("_Q17Kd")
	.dwattr DW$1028, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$1028, DW_AT_accessibility(DW_ACCESS_public)
DW$1029	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$1029, DW_AT_name("Q17User_Distacne"), DW_AT_symbol_name("_Q17User_Distacne")
	.dwattr DW$1029, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$1029, DW_AT_accessibility(DW_ACCESS_public)
DW$1030	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$1030, DW_AT_name("Q17Remaning_Disatance"), DW_AT_symbol_name("_Q17Remaning_Disatance")
	.dwattr DW$1030, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$1030, DW_AT_accessibility(DW_ACCESS_public)
DW$1031	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$1031, DW_AT_name("Q17Current_Velocity"), DW_AT_symbol_name("_Q17Current_Velocity")
	.dwattr DW$1031, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$1031, DW_AT_accessibility(DW_ACCESS_public)
DW$1032	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$1032, DW_AT_name("Q17StopDistance"), DW_AT_symbol_name("_Q17StopDistance")
	.dwattr DW$1032, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$1032, DW_AT_accessibility(DW_ACCESS_public)
DW$1033	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$1033, DW_AT_name("Q17Decel_Velocity"), DW_AT_symbol_name("_Q17Decel_Velocity")
	.dwattr DW$1033, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr DW$1033, DW_AT_accessibility(DW_ACCESS_public)
DW$1034	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$1034, DW_AT_name("Q17Next_Velocity"), DW_AT_symbol_name("_Q17Next_Velocity")
	.dwattr DW$1034, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$1034, DW_AT_accessibility(DW_ACCESS_public)
DW$1035	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$1035, DW_AT_name("Q17User_Velocity"), DW_AT_symbol_name("_Q17User_Velocity")
	.dwattr DW$1035, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr DW$1035, DW_AT_accessibility(DW_ACCESS_public)
DW$1036	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
	.dwattr DW$1036, DW_AT_name("Q17ErrVelocity"), DW_AT_symbol_name("_Q17ErrVelocity")
	.dwattr DW$1036, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr DW$1036, DW_AT_accessibility(DW_ACCESS_public)
DW$1037	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$1037, DW_AT_name("Q17ErrVelocitySum"), DW_AT_symbol_name("_Q17ErrVelocitySum")
	.dwattr DW$1037, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr DW$1037, DW_AT_accessibility(DW_ACCESS_public)
DW$1038	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$1038, DW_AT_name("q17proportionalterm"), DW_AT_symbol_name("_q17proportionalterm")
	.dwattr DW$1038, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr DW$1038, DW_AT_accessibility(DW_ACCESS_public)
DW$1039	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$1039, DW_AT_name("q17derivativeterm"), DW_AT_symbol_name("_q17derivativeterm")
	.dwattr DW$1039, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr DW$1039, DW_AT_accessibility(DW_ACCESS_public)
DW$1040	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$1040, DW_AT_name("q17integralterm"), DW_AT_symbol_name("_q17integralterm")
	.dwattr DW$1040, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr DW$1040, DW_AT_accessibility(DW_ACCESS_public)
DW$1041	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$1041, DW_AT_name("q17pidoutterm"), DW_AT_symbol_name("_q17pidoutterm")
	.dwattr DW$1041, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr DW$1041, DW_AT_accessibility(DW_ACCESS_public)
DW$1042	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
	.dwattr DW$1042, DW_AT_name("q26posadjrate"), DW_AT_symbol_name("_q26posadjrate")
	.dwattr DW$1042, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr DW$1042, DW_AT_accessibility(DW_ACCESS_public)
DW$1043	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$1043, DW_AT_name("i32Accel"), DW_AT_symbol_name("_i32Accel")
	.dwattr DW$1043, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr DW$1043, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$29


DW$T$30	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$30, DW_AT_name("GPADAT_BITS")
	.dwattr DW$T$30, DW_AT_byte_size(0x02)
DW$1044	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1044, DW_AT_name("GPIO0"), DW_AT_symbol_name("_GPIO0")
	.dwattr DW$1044, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr DW$1044, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1044, DW_AT_accessibility(DW_ACCESS_public)
DW$1045	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1045, DW_AT_name("GPIO1"), DW_AT_symbol_name("_GPIO1")
	.dwattr DW$1045, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr DW$1045, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1045, DW_AT_accessibility(DW_ACCESS_public)
DW$1046	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1046, DW_AT_name("GPIO2"), DW_AT_symbol_name("_GPIO2")
	.dwattr DW$1046, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr DW$1046, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1046, DW_AT_accessibility(DW_ACCESS_public)
DW$1047	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1047, DW_AT_name("GPIO3"), DW_AT_symbol_name("_GPIO3")
	.dwattr DW$1047, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr DW$1047, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1047, DW_AT_accessibility(DW_ACCESS_public)
DW$1048	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1048, DW_AT_name("GPIO4"), DW_AT_symbol_name("_GPIO4")
	.dwattr DW$1048, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr DW$1048, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1048, DW_AT_accessibility(DW_ACCESS_public)
DW$1049	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1049, DW_AT_name("GPIO5"), DW_AT_symbol_name("_GPIO5")
	.dwattr DW$1049, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr DW$1049, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1049, DW_AT_accessibility(DW_ACCESS_public)
DW$1050	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1050, DW_AT_name("GPIO6"), DW_AT_symbol_name("_GPIO6")
	.dwattr DW$1050, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr DW$1050, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1050, DW_AT_accessibility(DW_ACCESS_public)
DW$1051	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1051, DW_AT_name("GPIO7"), DW_AT_symbol_name("_GPIO7")
	.dwattr DW$1051, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr DW$1051, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1051, DW_AT_accessibility(DW_ACCESS_public)
DW$1052	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1052, DW_AT_name("GPIO8"), DW_AT_symbol_name("_GPIO8")
	.dwattr DW$1052, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr DW$1052, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1052, DW_AT_accessibility(DW_ACCESS_public)
DW$1053	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1053, DW_AT_name("GPIO9"), DW_AT_symbol_name("_GPIO9")
	.dwattr DW$1053, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr DW$1053, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1053, DW_AT_accessibility(DW_ACCESS_public)
DW$1054	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1054, DW_AT_name("GPIO10"), DW_AT_symbol_name("_GPIO10")
	.dwattr DW$1054, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr DW$1054, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1054, DW_AT_accessibility(DW_ACCESS_public)
DW$1055	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1055, DW_AT_name("GPIO11"), DW_AT_symbol_name("_GPIO11")
	.dwattr DW$1055, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr DW$1055, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1055, DW_AT_accessibility(DW_ACCESS_public)
DW$1056	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1056, DW_AT_name("GPIO12"), DW_AT_symbol_name("_GPIO12")
	.dwattr DW$1056, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr DW$1056, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1056, DW_AT_accessibility(DW_ACCESS_public)
DW$1057	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1057, DW_AT_name("GPIO13"), DW_AT_symbol_name("_GPIO13")
	.dwattr DW$1057, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr DW$1057, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1057, DW_AT_accessibility(DW_ACCESS_public)
DW$1058	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1058, DW_AT_name("GPIO14"), DW_AT_symbol_name("_GPIO14")
	.dwattr DW$1058, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr DW$1058, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1058, DW_AT_accessibility(DW_ACCESS_public)
DW$1059	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1059, DW_AT_name("GPIO15"), DW_AT_symbol_name("_GPIO15")
	.dwattr DW$1059, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr DW$1059, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1059, DW_AT_accessibility(DW_ACCESS_public)
DW$1060	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1060, DW_AT_name("GPIO16"), DW_AT_symbol_name("_GPIO16")
	.dwattr DW$1060, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr DW$1060, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1060, DW_AT_accessibility(DW_ACCESS_public)
DW$1061	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1061, DW_AT_name("GPIO17"), DW_AT_symbol_name("_GPIO17")
	.dwattr DW$1061, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr DW$1061, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1061, DW_AT_accessibility(DW_ACCESS_public)
DW$1062	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1062, DW_AT_name("GPIO18"), DW_AT_symbol_name("_GPIO18")
	.dwattr DW$1062, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr DW$1062, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1062, DW_AT_accessibility(DW_ACCESS_public)
DW$1063	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1063, DW_AT_name("GPIO19"), DW_AT_symbol_name("_GPIO19")
	.dwattr DW$1063, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr DW$1063, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1063, DW_AT_accessibility(DW_ACCESS_public)
DW$1064	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1064, DW_AT_name("GPIO20"), DW_AT_symbol_name("_GPIO20")
	.dwattr DW$1064, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr DW$1064, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1064, DW_AT_accessibility(DW_ACCESS_public)
DW$1065	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1065, DW_AT_name("GPIO21"), DW_AT_symbol_name("_GPIO21")
	.dwattr DW$1065, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr DW$1065, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1065, DW_AT_accessibility(DW_ACCESS_public)
DW$1066	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1066, DW_AT_name("GPIO22"), DW_AT_symbol_name("_GPIO22")
	.dwattr DW$1066, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr DW$1066, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1066, DW_AT_accessibility(DW_ACCESS_public)
DW$1067	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1067, DW_AT_name("GPIO23"), DW_AT_symbol_name("_GPIO23")
	.dwattr DW$1067, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr DW$1067, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1067, DW_AT_accessibility(DW_ACCESS_public)
DW$1068	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1068, DW_AT_name("GPIO24"), DW_AT_symbol_name("_GPIO24")
	.dwattr DW$1068, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr DW$1068, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1068, DW_AT_accessibility(DW_ACCESS_public)
DW$1069	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1069, DW_AT_name("GPIO25"), DW_AT_symbol_name("_GPIO25")
	.dwattr DW$1069, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr DW$1069, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1069, DW_AT_accessibility(DW_ACCESS_public)
DW$1070	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1070, DW_AT_name("GPIO26"), DW_AT_symbol_name("_GPIO26")
	.dwattr DW$1070, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr DW$1070, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1070, DW_AT_accessibility(DW_ACCESS_public)
DW$1071	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1071, DW_AT_name("GPIO27"), DW_AT_symbol_name("_GPIO27")
	.dwattr DW$1071, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr DW$1071, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1071, DW_AT_accessibility(DW_ACCESS_public)
DW$1072	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1072, DW_AT_name("GPIO28"), DW_AT_symbol_name("_GPIO28")
	.dwattr DW$1072, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr DW$1072, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1072, DW_AT_accessibility(DW_ACCESS_public)
DW$1073	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1073, DW_AT_name("GPIO29"), DW_AT_symbol_name("_GPIO29")
	.dwattr DW$1073, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr DW$1073, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1073, DW_AT_accessibility(DW_ACCESS_public)
DW$1074	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1074, DW_AT_name("GPIO30"), DW_AT_symbol_name("_GPIO30")
	.dwattr DW$1074, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr DW$1074, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1074, DW_AT_accessibility(DW_ACCESS_public)
DW$1075	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1075, DW_AT_name("GPIO31"), DW_AT_symbol_name("_GPIO31")
	.dwattr DW$1075, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr DW$1075, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1075, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$30


DW$T$31	.dwtag  DW_TAG_union_type
	.dwattr DW$T$31, DW_AT_name("GPADAT_REG")
	.dwattr DW$T$31, DW_AT_byte_size(0x02)
DW$1076	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$1076, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1076, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1076, DW_AT_accessibility(DW_ACCESS_public)
DW$1077	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
	.dwattr DW$1077, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$1077, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1077, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$31


DW$T$33	.dwtag  DW_TAG_union_type
	.dwattr DW$T$33, DW_AT_name("GPBDAT_REG")
	.dwattr DW$T$33, DW_AT_byte_size(0x02)
DW$1078	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$1078, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1078, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1078, DW_AT_accessibility(DW_ACCESS_public)
DW$1079	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
	.dwattr DW$1079, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$1079, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1079, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$33


DW$T$37	.dwtag  DW_TAG_union_type
	.dwattr DW$T$37, DW_AT_name("TIM_GROUP")
	.dwattr DW$T$37, DW_AT_byte_size(0x02)
DW$1080	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$1080, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1080, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1080, DW_AT_accessibility(DW_ACCESS_public)
DW$1081	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
	.dwattr DW$1081, DW_AT_name("half"), DW_AT_symbol_name("_half")
	.dwattr DW$1081, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1081, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$37


DW$T$39	.dwtag  DW_TAG_union_type
	.dwattr DW$T$39, DW_AT_name("PRD_GROUP")
	.dwattr DW$T$39, DW_AT_byte_size(0x02)
DW$1082	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$1082, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1082, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1082, DW_AT_accessibility(DW_ACCESS_public)
DW$1083	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
	.dwattr DW$1083, DW_AT_name("half"), DW_AT_symbol_name("_half")
	.dwattr DW$1083, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1083, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$39


DW$T$41	.dwtag  DW_TAG_union_type
	.dwattr DW$T$41, DW_AT_name("TCR_REG")
	.dwattr DW$T$41, DW_AT_byte_size(0x01)
DW$1084	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1084, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1084, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1084, DW_AT_accessibility(DW_ACCESS_public)
DW$1085	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
	.dwattr DW$1085, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$1085, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1085, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$41


DW$T$43	.dwtag  DW_TAG_union_type
	.dwattr DW$T$43, DW_AT_name("TPR_REG")
	.dwattr DW$T$43, DW_AT_byte_size(0x01)
DW$1086	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1086, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1086, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1086, DW_AT_accessibility(DW_ACCESS_public)
DW$1087	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
	.dwattr DW$1087, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$1087, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1087, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$43


DW$T$45	.dwtag  DW_TAG_union_type
	.dwattr DW$T$45, DW_AT_name("TPRH_REG")
	.dwattr DW$T$45, DW_AT_byte_size(0x01)
DW$1088	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1088, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1088, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1088, DW_AT_accessibility(DW_ACCESS_public)
DW$1089	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
	.dwattr DW$1089, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$1089, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1089, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$45


DW$T$48	.dwtag  DW_TAG_union_type
	.dwattr DW$T$48, DW_AT_name("TBCTL_REG")
	.dwattr DW$T$48, DW_AT_byte_size(0x01)
DW$1090	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1090, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1090, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1090, DW_AT_accessibility(DW_ACCESS_public)
DW$1091	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
	.dwattr DW$1091, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$1091, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1091, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$48


DW$T$50	.dwtag  DW_TAG_union_type
	.dwattr DW$T$50, DW_AT_name("TBSTS_REG")
	.dwattr DW$T$50, DW_AT_byte_size(0x01)
DW$1092	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1092, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1092, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1092, DW_AT_accessibility(DW_ACCESS_public)
DW$1093	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
	.dwattr DW$1093, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$1093, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1093, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$50


DW$T$52	.dwtag  DW_TAG_union_type
	.dwattr DW$T$52, DW_AT_name("TBPHS_HRPWM_GROUP")
	.dwattr DW$T$52, DW_AT_byte_size(0x02)
DW$1094	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$1094, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1094, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1094, DW_AT_accessibility(DW_ACCESS_public)
DW$1095	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
	.dwattr DW$1095, DW_AT_name("half"), DW_AT_symbol_name("_half")
	.dwattr DW$1095, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1095, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$52


DW$T$54	.dwtag  DW_TAG_union_type
	.dwattr DW$T$54, DW_AT_name("CMPCTL_REG")
	.dwattr DW$T$54, DW_AT_byte_size(0x01)
DW$1096	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1096, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1096, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1096, DW_AT_accessibility(DW_ACCESS_public)
DW$1097	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$53)
	.dwattr DW$1097, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$1097, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1097, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$54


DW$T$56	.dwtag  DW_TAG_union_type
	.dwattr DW$T$56, DW_AT_name("CMPA_HRPWM_GROUP")
	.dwattr DW$T$56, DW_AT_byte_size(0x02)
DW$1098	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$1098, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1098, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1098, DW_AT_accessibility(DW_ACCESS_public)
DW$1099	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
	.dwattr DW$1099, DW_AT_name("half"), DW_AT_symbol_name("_half")
	.dwattr DW$1099, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1099, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$56


DW$T$58	.dwtag  DW_TAG_union_type
	.dwattr DW$T$58, DW_AT_name("AQCTL_REG")
	.dwattr DW$T$58, DW_AT_byte_size(0x01)
DW$1100	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1100, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1100, DW_AT_accessibility(DW_ACCESS_public)
DW$1101	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$57)
	.dwattr DW$1101, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$1101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1101, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$58


DW$T$60	.dwtag  DW_TAG_union_type
	.dwattr DW$T$60, DW_AT_name("AQSFRC_REG")
	.dwattr DW$T$60, DW_AT_byte_size(0x01)
DW$1102	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1102, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1102, DW_AT_accessibility(DW_ACCESS_public)
DW$1103	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
	.dwattr DW$1103, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$1103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1103, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$60


DW$T$62	.dwtag  DW_TAG_union_type
	.dwattr DW$T$62, DW_AT_name("AQCSFRC_REG")
	.dwattr DW$T$62, DW_AT_byte_size(0x01)
DW$1104	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1104, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1104, DW_AT_accessibility(DW_ACCESS_public)
DW$1105	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$61)
	.dwattr DW$1105, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$1105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1105, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$62


DW$T$64	.dwtag  DW_TAG_union_type
	.dwattr DW$T$64, DW_AT_name("DBCTL_REG")
	.dwattr DW$T$64, DW_AT_byte_size(0x01)
DW$1106	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1106, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1106, DW_AT_accessibility(DW_ACCESS_public)
DW$1107	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$63)
	.dwattr DW$1107, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$1107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1107, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$64


DW$T$66	.dwtag  DW_TAG_union_type
	.dwattr DW$T$66, DW_AT_name("TZSEL_REG")
	.dwattr DW$T$66, DW_AT_byte_size(0x01)
DW$1108	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1108, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1108, DW_AT_accessibility(DW_ACCESS_public)
DW$1109	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
	.dwattr DW$1109, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$1109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1109, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$66


DW$T$68	.dwtag  DW_TAG_union_type
	.dwattr DW$T$68, DW_AT_name("TZCTL_REG")
	.dwattr DW$T$68, DW_AT_byte_size(0x01)
DW$1110	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1110, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1110, DW_AT_accessibility(DW_ACCESS_public)
DW$1111	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
	.dwattr DW$1111, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$1111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1111, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$68


DW$T$70	.dwtag  DW_TAG_union_type
	.dwattr DW$T$70, DW_AT_name("TZEINT_REG")
	.dwattr DW$T$70, DW_AT_byte_size(0x01)
DW$1112	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1112, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1112, DW_AT_accessibility(DW_ACCESS_public)
DW$1113	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
	.dwattr DW$1113, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$1113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1113, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$70


DW$T$72	.dwtag  DW_TAG_union_type
	.dwattr DW$T$72, DW_AT_name("TZFLG_REG")
	.dwattr DW$T$72, DW_AT_byte_size(0x01)
DW$1114	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1114, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1114, DW_AT_accessibility(DW_ACCESS_public)
DW$1115	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$71)
	.dwattr DW$1115, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$1115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1115, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$72


DW$T$74	.dwtag  DW_TAG_union_type
	.dwattr DW$T$74, DW_AT_name("TZCLR_REG")
	.dwattr DW$T$74, DW_AT_byte_size(0x01)
DW$1116	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1116, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1116, DW_AT_accessibility(DW_ACCESS_public)
DW$1117	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$73)
	.dwattr DW$1117, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$1117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1117, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$74


DW$T$76	.dwtag  DW_TAG_union_type
	.dwattr DW$T$76, DW_AT_name("TZFRC_REG")
	.dwattr DW$T$76, DW_AT_byte_size(0x01)
DW$1118	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1118, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1118, DW_AT_accessibility(DW_ACCESS_public)
DW$1119	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$75)
	.dwattr DW$1119, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$1119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1119, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$76


DW$T$78	.dwtag  DW_TAG_union_type
	.dwattr DW$T$78, DW_AT_name("ETSEL_REG")
	.dwattr DW$T$78, DW_AT_byte_size(0x01)
DW$1120	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1120, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1120, DW_AT_accessibility(DW_ACCESS_public)
DW$1121	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$77)
	.dwattr DW$1121, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$1121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1121, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$78


DW$T$80	.dwtag  DW_TAG_union_type
	.dwattr DW$T$80, DW_AT_name("ETPS_REG")
	.dwattr DW$T$80, DW_AT_byte_size(0x01)
DW$1122	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1122, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1122, DW_AT_accessibility(DW_ACCESS_public)
DW$1123	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$79)
	.dwattr DW$1123, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$1123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1123, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$80


DW$T$82	.dwtag  DW_TAG_union_type
	.dwattr DW$T$82, DW_AT_name("ETFLG_REG")
	.dwattr DW$T$82, DW_AT_byte_size(0x01)
DW$1124	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1124, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1124, DW_AT_accessibility(DW_ACCESS_public)
DW$1125	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$81)
	.dwattr DW$1125, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$1125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1125, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$82


DW$T$84	.dwtag  DW_TAG_union_type
	.dwattr DW$T$84, DW_AT_name("ETCLR_REG")
	.dwattr DW$T$84, DW_AT_byte_size(0x01)
DW$1126	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1126, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1126, DW_AT_accessibility(DW_ACCESS_public)
DW$1127	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$83)
	.dwattr DW$1127, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$1127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1127, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$84


DW$T$86	.dwtag  DW_TAG_union_type
	.dwattr DW$T$86, DW_AT_name("ETFRC_REG")
	.dwattr DW$T$86, DW_AT_byte_size(0x01)
DW$1128	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1128, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1128, DW_AT_accessibility(DW_ACCESS_public)
DW$1129	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$85)
	.dwattr DW$1129, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$1129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1129, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$86


DW$T$88	.dwtag  DW_TAG_union_type
	.dwattr DW$T$88, DW_AT_name("PCCTL_REG")
	.dwattr DW$T$88, DW_AT_byte_size(0x01)
DW$1130	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1130, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1130, DW_AT_accessibility(DW_ACCESS_public)
DW$1131	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$87)
	.dwattr DW$1131, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$1131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1131, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$88


DW$T$90	.dwtag  DW_TAG_union_type
	.dwattr DW$T$90, DW_AT_name("HRCNFG_REG")
	.dwattr DW$T$90, DW_AT_byte_size(0x01)
DW$1132	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1132, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1132, DW_AT_accessibility(DW_ACCESS_public)
DW$1133	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$89)
	.dwattr DW$1133, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$1133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1133, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$90


DW$T$93	.dwtag  DW_TAG_union_type
	.dwattr DW$T$93, DW_AT_name("QDECCTL_REG")
	.dwattr DW$T$93, DW_AT_byte_size(0x01)
DW$1134	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1134, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1134, DW_AT_accessibility(DW_ACCESS_public)
DW$1135	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$92)
	.dwattr DW$1135, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$1135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1135, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$93


DW$T$95	.dwtag  DW_TAG_union_type
	.dwattr DW$T$95, DW_AT_name("QEPCTL_REG")
	.dwattr DW$T$95, DW_AT_byte_size(0x01)
DW$1136	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1136, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1136, DW_AT_accessibility(DW_ACCESS_public)
DW$1137	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$94)
	.dwattr DW$1137, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$1137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1137, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$95


DW$T$97	.dwtag  DW_TAG_union_type
	.dwattr DW$T$97, DW_AT_name("QCAPCTL_REG")
	.dwattr DW$T$97, DW_AT_byte_size(0x01)
DW$1138	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1138, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1138, DW_AT_accessibility(DW_ACCESS_public)
DW$1139	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$96)
	.dwattr DW$1139, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$1139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1139, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$97


DW$T$99	.dwtag  DW_TAG_union_type
	.dwattr DW$T$99, DW_AT_name("QPOSCTL_REG")
	.dwattr DW$T$99, DW_AT_byte_size(0x01)
DW$1140	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1140, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1140, DW_AT_accessibility(DW_ACCESS_public)
DW$1141	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$98)
	.dwattr DW$1141, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$1141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1141, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$99


DW$T$101	.dwtag  DW_TAG_union_type
	.dwattr DW$T$101, DW_AT_name("QEINT_REG")
	.dwattr DW$T$101, DW_AT_byte_size(0x01)
DW$1142	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1142, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1142, DW_AT_accessibility(DW_ACCESS_public)
DW$1143	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$100)
	.dwattr DW$1143, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$1143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1143, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$101


DW$T$103	.dwtag  DW_TAG_union_type
	.dwattr DW$T$103, DW_AT_name("QFLG_REG")
	.dwattr DW$T$103, DW_AT_byte_size(0x01)
DW$1144	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1144, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1144, DW_AT_accessibility(DW_ACCESS_public)
DW$1145	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$102)
	.dwattr DW$1145, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$1145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1145, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$103


DW$T$105	.dwtag  DW_TAG_union_type
	.dwattr DW$T$105, DW_AT_name("QFRC_REG")
	.dwattr DW$T$105, DW_AT_byte_size(0x01)
DW$1146	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1146, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1146, DW_AT_accessibility(DW_ACCESS_public)
DW$1147	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$104)
	.dwattr DW$1147, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$1147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1147, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$105


DW$T$107	.dwtag  DW_TAG_union_type
	.dwattr DW$T$107, DW_AT_name("QEPSTS_REG")
	.dwattr DW$T$107, DW_AT_byte_size(0x01)
DW$1148	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1148, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$1148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1148, DW_AT_accessibility(DW_ACCESS_public)
DW$1149	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$106)
	.dwattr DW$1149, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
	.dwattr DW$1149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1149, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$107


DW$T$110	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$110, DW_AT_name("Path")
	.dwattr DW$T$110, DW_AT_byte_size(0x02)
DW$1150	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1150, DW_AT_name("Position"), DW_AT_symbol_name("_Position")
	.dwattr DW$1150, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
	.dwattr DW$1150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1150, DW_AT_accessibility(DW_ACCESS_public)
DW$1151	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1151, DW_AT_name("TurnDir"), DW_AT_symbol_name("_TurnDir")
	.dwattr DW$1151, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
	.dwattr DW$1151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1151, DW_AT_accessibility(DW_ACCESS_public)
DW$1152	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1152, DW_AT_name("MouseDir"), DW_AT_symbol_name("_MouseDir")
	.dwattr DW$1152, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
	.dwattr DW$1152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1152, DW_AT_accessibility(DW_ACCESS_public)
DW$1153	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1153, DW_AT_name("PathCnt"), DW_AT_symbol_name("_PathCnt")
	.dwattr DW$1153, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
	.dwattr DW$1153, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1153, DW_AT_accessibility(DW_ACCESS_public)
DW$1154	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1154, DW_AT_name("PathState"), DW_AT_symbol_name("_PathState")
	.dwattr DW$1154, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
	.dwattr DW$1154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1154, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$110


DW$T$118	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$118, DW_AT_byte_size(0x1e)
DW$1155	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$113)
	.dwattr DW$1155, DW_AT_name("pTurnInEdge"), DW_AT_symbol_name("_pTurnInEdge")
	.dwattr DW$1155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1155, DW_AT_accessibility(DW_ACCESS_public)
DW$1156	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$116)
	.dwattr DW$1156, DW_AT_name("pTurnInSensor"), DW_AT_symbol_name("_pTurnInSensor")
	.dwattr DW$1156, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$1156, DW_AT_accessibility(DW_ACCESS_public)
DW$1157	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1157, DW_AT_name("u16TurnInTime"), DW_AT_symbol_name("_u16TurnInTime")
	.dwattr DW$1157, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$1157, DW_AT_accessibility(DW_ACCESS_public)
DW$1158	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1158, DW_AT_name("u16TurnInErr"), DW_AT_symbol_name("_u16TurnInErr")
	.dwattr DW$1158, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$1158, DW_AT_accessibility(DW_ACCESS_public)
DW$1159	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1159, DW_AT_name("u16TurnAccTime"), DW_AT_symbol_name("_u16TurnAccTime")
	.dwattr DW$1159, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$1159, DW_AT_accessibility(DW_ACCESS_public)
DW$1160	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1160, DW_AT_name("u16TurnTime"), DW_AT_symbol_name("_u16TurnTime")
	.dwattr DW$1160, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$1160, DW_AT_accessibility(DW_ACCESS_public)
DW$1161	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1161, DW_AT_name("u16TurnOutTime"), DW_AT_symbol_name("_u16TurnOutTime")
	.dwattr DW$1161, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$1161, DW_AT_accessibility(DW_ACCESS_public)
DW$1162	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
	.dwattr DW$1162, DW_AT_name("i32RightAccel"), DW_AT_symbol_name("_i32RightAccel")
	.dwattr DW$1162, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$1162, DW_AT_accessibility(DW_ACCESS_public)
DW$1163	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
	.dwattr DW$1163, DW_AT_name("i32LeftAccel"), DW_AT_symbol_name("_i32LeftAccel")
	.dwattr DW$1163, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$1163, DW_AT_accessibility(DW_ACCESS_public)
DW$1164	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$1164, DW_AT_name("q17RightVelocity"), DW_AT_symbol_name("_q17RightVelocity")
	.dwattr DW$1164, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$1164, DW_AT_accessibility(DW_ACCESS_public)
DW$1165	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$1165, DW_AT_name("q17LeftVelocity"), DW_AT_symbol_name("_q17LeftVelocity")
	.dwattr DW$1165, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$1165, DW_AT_accessibility(DW_ACCESS_public)
DW$1166	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$1166, DW_AT_name("q17RefVel"), DW_AT_symbol_name("_q17RefVel")
	.dwattr DW$1166, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$1166, DW_AT_accessibility(DW_ACCESS_public)
DW$1167	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1167, DW_AT_name("u16EdgeTick0"), DW_AT_symbol_name("_u16EdgeTick0")
	.dwattr DW$1167, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$1167, DW_AT_accessibility(DW_ACCESS_public)
DW$1168	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1168, DW_AT_name("u16EdgeTick1"), DW_AT_symbol_name("_u16EdgeTick1")
	.dwattr DW$1168, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr DW$1168, DW_AT_accessibility(DW_ACCESS_public)
DW$1169	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1169, DW_AT_name("u16EdgeTick2"), DW_AT_symbol_name("_u16EdgeTick2")
	.dwattr DW$1169, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$1169, DW_AT_accessibility(DW_ACCESS_public)
DW$1170	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1170, DW_AT_name("u16EdgeTick3"), DW_AT_symbol_name("_u16EdgeTick3")
	.dwattr DW$1170, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr DW$1170, DW_AT_accessibility(DW_ACCESS_public)
DW$1171	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$116)
	.dwattr DW$1171, DW_AT_name("pTurnEdgeSen"), DW_AT_symbol_name("_pTurnEdgeSen")
	.dwattr DW$1171, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$1171, DW_AT_accessibility(DW_ACCESS_public)
DW$1172	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$116)
	.dwattr DW$1172, DW_AT_name("pTurnFEdgeSen"), DW_AT_symbol_name("_pTurnFEdgeSen")
	.dwattr DW$1172, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr DW$1172, DW_AT_accessibility(DW_ACCESS_public)
DW$1173	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$116)
	.dwattr DW$1173, DW_AT_name("pTurnFrontSen"), DW_AT_symbol_name("_pTurnFrontSen")
	.dwattr DW$1173, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$1173, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$118

DW$T$353	.dwtag  DW_TAG_typedef, DW_AT_name("TurnInfoVariable"), DW_AT_type(*DW$T$118)
	.dwattr DW$T$353, DW_AT_language(DW_LANG_C)

DW$T$119	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$119, DW_AT_byte_size(0x08)
DW$1174	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$1174, DW_AT_name("T90OutDis"), DW_AT_symbol_name("_T90OutDis")
	.dwattr DW$1174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1174, DW_AT_accessibility(DW_ACCESS_public)
DW$1175	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$1175, DW_AT_name("T45OutDis"), DW_AT_symbol_name("_T45OutDis")
	.dwattr DW$1175, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$1175, DW_AT_accessibility(DW_ACCESS_public)
DW$1176	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$1176, DW_AT_name("T135OutDis"), DW_AT_symbol_name("_T135OutDis")
	.dwattr DW$1176, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$1176, DW_AT_accessibility(DW_ACCESS_public)
DW$1177	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$1177, DW_AT_name("T180OutDis"), DW_AT_symbol_name("_T180OutDis")
	.dwattr DW$1177, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$1177, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$119

DW$1178	.dwtag  DW_TAG_far_type
	.dwattr DW$1178, DW_AT_type(*DW$T$120)
DW$T$424	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$424, DW_AT_type(*DW$1178)

DW$T$27	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$20)
	.dwattr DW$T$27, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$27, DW_AT_byte_size(0x08)
DW$1179	.dwtag  DW_TAG_subrange_type
	.dwattr DW$1179, DW_AT_upper_bound(0x03)
	.dwendtag DW$T$27

DW$T$25	.dwtag  DW_TAG_typedef, DW_AT_name("_iq27"), DW_AT_type(*DW$T$12)
	.dwattr DW$T$25, DW_AT_language(DW_LANG_C)
DW$T$26	.dwtag  DW_TAG_typedef, DW_AT_name("_iq16"), DW_AT_type(*DW$T$12)
	.dwattr DW$T$26, DW_AT_language(DW_LANG_C)

DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$32, DW_AT_name("GPBDAT_BITS")
	.dwattr DW$T$32, DW_AT_byte_size(0x02)
DW$1180	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1180, DW_AT_name("GPIO32"), DW_AT_symbol_name("_GPIO32")
	.dwattr DW$1180, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr DW$1180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1180, DW_AT_accessibility(DW_ACCESS_public)
DW$1181	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1181, DW_AT_name("GPIO33"), DW_AT_symbol_name("_GPIO33")
	.dwattr DW$1181, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr DW$1181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1181, DW_AT_accessibility(DW_ACCESS_public)
DW$1182	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1182, DW_AT_name("GPIO34"), DW_AT_symbol_name("_GPIO34")
	.dwattr DW$1182, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr DW$1182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1182, DW_AT_accessibility(DW_ACCESS_public)
DW$1183	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1183, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
	.dwattr DW$1183, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr DW$1183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1183, DW_AT_accessibility(DW_ACCESS_public)
DW$1184	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1184, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
	.dwattr DW$1184, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
	.dwattr DW$1184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1184, DW_AT_accessibility(DW_ACCESS_public)
DW$1185	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1185, DW_AT_name("rsvd3"), DW_AT_symbol_name("_rsvd3")
	.dwattr DW$1185, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
	.dwattr DW$1185, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1185, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$32


DW$T$36	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$36, DW_AT_name("TIM_REG")
	.dwattr DW$T$36, DW_AT_byte_size(0x02)
DW$1186	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1186, DW_AT_name("LSW"), DW_AT_symbol_name("_LSW")
	.dwattr DW$1186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1186, DW_AT_accessibility(DW_ACCESS_public)
DW$1187	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1187, DW_AT_name("MSW"), DW_AT_symbol_name("_MSW")
	.dwattr DW$1187, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1187, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$36


DW$T$38	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$38, DW_AT_name("PRD_REG")
	.dwattr DW$T$38, DW_AT_byte_size(0x02)
DW$1188	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1188, DW_AT_name("LSW"), DW_AT_symbol_name("_LSW")
	.dwattr DW$1188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1188, DW_AT_accessibility(DW_ACCESS_public)
DW$1189	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1189, DW_AT_name("MSW"), DW_AT_symbol_name("_MSW")
	.dwattr DW$1189, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1189, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$38


DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$40, DW_AT_name("TCR_BITS")
	.dwattr DW$T$40, DW_AT_byte_size(0x01)
DW$1190	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1190, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
	.dwattr DW$1190, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
	.dwattr DW$1190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1190, DW_AT_accessibility(DW_ACCESS_public)
DW$1191	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1191, DW_AT_name("TSS"), DW_AT_symbol_name("_TSS")
	.dwattr DW$1191, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr DW$1191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1191, DW_AT_accessibility(DW_ACCESS_public)
DW$1192	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1192, DW_AT_name("TRB"), DW_AT_symbol_name("_TRB")
	.dwattr DW$1192, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr DW$1192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1192, DW_AT_accessibility(DW_ACCESS_public)
DW$1193	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1193, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
	.dwattr DW$1193, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x04)
	.dwattr DW$1193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1193, DW_AT_accessibility(DW_ACCESS_public)
DW$1194	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1194, DW_AT_name("SOFT"), DW_AT_symbol_name("_SOFT")
	.dwattr DW$1194, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr DW$1194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1194, DW_AT_accessibility(DW_ACCESS_public)
DW$1195	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1195, DW_AT_name("FREE"), DW_AT_symbol_name("_FREE")
	.dwattr DW$1195, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr DW$1195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1195, DW_AT_accessibility(DW_ACCESS_public)
DW$1196	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1196, DW_AT_name("rsvd3"), DW_AT_symbol_name("_rsvd3")
	.dwattr DW$1196, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
	.dwattr DW$1196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1196, DW_AT_accessibility(DW_ACCESS_public)
DW$1197	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1197, DW_AT_name("TIE"), DW_AT_symbol_name("_TIE")
	.dwattr DW$1197, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr DW$1197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1197, DW_AT_accessibility(DW_ACCESS_public)
DW$1198	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1198, DW_AT_name("TIF"), DW_AT_symbol_name("_TIF")
	.dwattr DW$1198, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr DW$1198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1198, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$40


DW$T$42	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$42, DW_AT_name("TPR_BITS")
	.dwattr DW$T$42, DW_AT_byte_size(0x01)
DW$1199	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1199, DW_AT_name("TDDR"), DW_AT_symbol_name("_TDDR")
	.dwattr DW$1199, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
	.dwattr DW$1199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1199, DW_AT_accessibility(DW_ACCESS_public)
DW$1200	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1200, DW_AT_name("PSC"), DW_AT_symbol_name("_PSC")
	.dwattr DW$1200, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
	.dwattr DW$1200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1200, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$42


DW$T$44	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$44, DW_AT_name("TPRH_BITS")
	.dwattr DW$T$44, DW_AT_byte_size(0x01)
DW$1201	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1201, DW_AT_name("TDDRH"), DW_AT_symbol_name("_TDDRH")
	.dwattr DW$1201, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
	.dwattr DW$1201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1201, DW_AT_accessibility(DW_ACCESS_public)
DW$1202	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1202, DW_AT_name("PSCH"), DW_AT_symbol_name("_PSCH")
	.dwattr DW$1202, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
	.dwattr DW$1202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1202, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$44


DW$T$47	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$47, DW_AT_name("TBCTL_BITS")
	.dwattr DW$T$47, DW_AT_byte_size(0x01)
DW$1203	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1203, DW_AT_name("CTRMODE"), DW_AT_symbol_name("_CTRMODE")
	.dwattr DW$1203, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
	.dwattr DW$1203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1203, DW_AT_accessibility(DW_ACCESS_public)
DW$1204	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1204, DW_AT_name("PHSEN"), DW_AT_symbol_name("_PHSEN")
	.dwattr DW$1204, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr DW$1204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1204, DW_AT_accessibility(DW_ACCESS_public)
DW$1205	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1205, DW_AT_name("PRDLD"), DW_AT_symbol_name("_PRDLD")
	.dwattr DW$1205, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr DW$1205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1205, DW_AT_accessibility(DW_ACCESS_public)
DW$1206	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1206, DW_AT_name("SYNCOSEL"), DW_AT_symbol_name("_SYNCOSEL")
	.dwattr DW$1206, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
	.dwattr DW$1206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1206, DW_AT_accessibility(DW_ACCESS_public)
DW$1207	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1207, DW_AT_name("SWFSYNC"), DW_AT_symbol_name("_SWFSYNC")
	.dwattr DW$1207, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr DW$1207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1207, DW_AT_accessibility(DW_ACCESS_public)
DW$1208	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1208, DW_AT_name("HSPCLKDIV"), DW_AT_symbol_name("_HSPCLKDIV")
	.dwattr DW$1208, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x03)
	.dwattr DW$1208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1208, DW_AT_accessibility(DW_ACCESS_public)
DW$1209	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1209, DW_AT_name("CLKDIV"), DW_AT_symbol_name("_CLKDIV")
	.dwattr DW$1209, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x03)
	.dwattr DW$1209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1209, DW_AT_accessibility(DW_ACCESS_public)
DW$1210	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1210, DW_AT_name("PHSDIR"), DW_AT_symbol_name("_PHSDIR")
	.dwattr DW$1210, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr DW$1210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1210, DW_AT_accessibility(DW_ACCESS_public)
DW$1211	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1211, DW_AT_name("FREE_SOFT"), DW_AT_symbol_name("_FREE_SOFT")
	.dwattr DW$1211, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
	.dwattr DW$1211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1211, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$47


DW$T$49	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$49, DW_AT_name("TBSTS_BITS")
	.dwattr DW$T$49, DW_AT_byte_size(0x01)
DW$1212	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1212, DW_AT_name("CTRDIR"), DW_AT_symbol_name("_CTRDIR")
	.dwattr DW$1212, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr DW$1212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1212, DW_AT_accessibility(DW_ACCESS_public)
DW$1213	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1213, DW_AT_name("SYNCI"), DW_AT_symbol_name("_SYNCI")
	.dwattr DW$1213, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr DW$1213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1213, DW_AT_accessibility(DW_ACCESS_public)
DW$1214	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1214, DW_AT_name("CTRMAX"), DW_AT_symbol_name("_CTRMAX")
	.dwattr DW$1214, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr DW$1214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1214, DW_AT_accessibility(DW_ACCESS_public)
DW$1215	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1215, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
	.dwattr DW$1215, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
	.dwattr DW$1215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1215, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$49


DW$T$51	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$51, DW_AT_name("TBPHS_HRPWM_REG")
	.dwattr DW$T$51, DW_AT_byte_size(0x02)
DW$1216	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1216, DW_AT_name("TBPHSHR"), DW_AT_symbol_name("_TBPHSHR")
	.dwattr DW$1216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1216, DW_AT_accessibility(DW_ACCESS_public)
DW$1217	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1217, DW_AT_name("TBPHS"), DW_AT_symbol_name("_TBPHS")
	.dwattr DW$1217, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1217, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$51


DW$T$53	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$53, DW_AT_name("CMPCTL_BITS")
	.dwattr DW$T$53, DW_AT_byte_size(0x01)
DW$1218	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1218, DW_AT_name("LOADAMODE"), DW_AT_symbol_name("_LOADAMODE")
	.dwattr DW$1218, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
	.dwattr DW$1218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1218, DW_AT_accessibility(DW_ACCESS_public)
DW$1219	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1219, DW_AT_name("LOADBMODE"), DW_AT_symbol_name("_LOADBMODE")
	.dwattr DW$1219, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
	.dwattr DW$1219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1219, DW_AT_accessibility(DW_ACCESS_public)
DW$1220	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1220, DW_AT_name("SHDWAMODE"), DW_AT_symbol_name("_SHDWAMODE")
	.dwattr DW$1220, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr DW$1220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1220, DW_AT_accessibility(DW_ACCESS_public)
DW$1221	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1221, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
	.dwattr DW$1221, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr DW$1221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1221, DW_AT_accessibility(DW_ACCESS_public)
DW$1222	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1222, DW_AT_name("SHDWBMODE"), DW_AT_symbol_name("_SHDWBMODE")
	.dwattr DW$1222, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr DW$1222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1222, DW_AT_accessibility(DW_ACCESS_public)
DW$1223	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1223, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
	.dwattr DW$1223, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr DW$1223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1223, DW_AT_accessibility(DW_ACCESS_public)
DW$1224	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1224, DW_AT_name("SHDWAFULL"), DW_AT_symbol_name("_SHDWAFULL")
	.dwattr DW$1224, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr DW$1224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1224, DW_AT_accessibility(DW_ACCESS_public)
DW$1225	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1225, DW_AT_name("SHDWBFULL"), DW_AT_symbol_name("_SHDWBFULL")
	.dwattr DW$1225, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr DW$1225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1225, DW_AT_accessibility(DW_ACCESS_public)
DW$1226	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1226, DW_AT_name("rsvd3"), DW_AT_symbol_name("_rsvd3")
	.dwattr DW$1226, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
	.dwattr DW$1226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1226, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$53


DW$T$55	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$55, DW_AT_name("CMPA_HRPWM_REG")
	.dwattr DW$T$55, DW_AT_byte_size(0x02)
DW$1227	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1227, DW_AT_name("CMPAHR"), DW_AT_symbol_name("_CMPAHR")
	.dwattr DW$1227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1227, DW_AT_accessibility(DW_ACCESS_public)
DW$1228	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1228, DW_AT_name("CMPA"), DW_AT_symbol_name("_CMPA")
	.dwattr DW$1228, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1228, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$55


DW$T$57	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$57, DW_AT_name("AQCTL_BITS")
	.dwattr DW$T$57, DW_AT_byte_size(0x01)
DW$1229	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1229, DW_AT_name("ZRO"), DW_AT_symbol_name("_ZRO")
	.dwattr DW$1229, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
	.dwattr DW$1229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1229, DW_AT_accessibility(DW_ACCESS_public)
DW$1230	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1230, DW_AT_name("PRD"), DW_AT_symbol_name("_PRD")
	.dwattr DW$1230, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
	.dwattr DW$1230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1230, DW_AT_accessibility(DW_ACCESS_public)
DW$1231	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1231, DW_AT_name("CAU"), DW_AT_symbol_name("_CAU")
	.dwattr DW$1231, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
	.dwattr DW$1231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1231, DW_AT_accessibility(DW_ACCESS_public)
DW$1232	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1232, DW_AT_name("CAD"), DW_AT_symbol_name("_CAD")
	.dwattr DW$1232, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
	.dwattr DW$1232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1232, DW_AT_accessibility(DW_ACCESS_public)
DW$1233	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1233, DW_AT_name("CBU"), DW_AT_symbol_name("_CBU")
	.dwattr DW$1233, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
	.dwattr DW$1233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1233, DW_AT_accessibility(DW_ACCESS_public)
DW$1234	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1234, DW_AT_name("CBD"), DW_AT_symbol_name("_CBD")
	.dwattr DW$1234, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
	.dwattr DW$1234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1234, DW_AT_accessibility(DW_ACCESS_public)
DW$1235	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1235, DW_AT_name("rsvd"), DW_AT_symbol_name("_rsvd")
	.dwattr DW$1235, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
	.dwattr DW$1235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1235, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$57


DW$T$59	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$59, DW_AT_name("AQSFRC_BITS")
	.dwattr DW$T$59, DW_AT_byte_size(0x01)
DW$1236	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$1236, DW_AT_name("ACTSFA"), DW_AT_symbol_name("_ACTSFA")
